/*
SQLyog Ultimate v12.08 (64 bit)
MySQL - 5.7.26 : Database - el_oms
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`el_oms` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_bin */;

USE `el_oms`;

/*Table structure for table `cart` */

DROP TABLE IF EXISTS `cart`;

CREATE TABLE `cart` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT COMMENT '自增id',
  `wechat_id` int(11) NOT NULL COMMENT '顾客wechat id',
  `origin` tinyint(1) DEFAULT '0' COMMENT '来源   0  购物车   1     立即购买',
  `code_id` char(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '优惠码',
  `point_id` tinyint(1) DEFAULT NULL COMMENT '使用悦享钱应用方式  ',
  `coupon_id` int(11) DEFAULT NULL COMMENT '优惠卷id',
  `pdt_price` decimal(10,2) DEFAULT '0.00' COMMENT '商品原价',
  `price` decimal(10,2) DEFAULT '0.00' COMMENT '付款金额',
  `total_discount` decimal(10,2) DEFAULT '0.00' COMMENT '优惠总金额',
  `total_product_price` decimal(10,2) DEFAULT NULL COMMENT '商品原总金额',
  `total_product_discount` decimal(10,2) DEFAULT '0.00' COMMENT '商品折扣金额',
  `total_order_discount` decimal(10,2) DEFAULT '0.00' COMMENT '满减折扣',
  `total_point_discount` decimal(10,2) DEFAULT '0.00' COMMENT '悦享钱优惠金额',
  `total_member_discount` decimal(10,2) DEFAULT '0.00' COMMENT '会员优惠金额',
  `total_code_discount` decimal(10,2) DEFAULT '0.00' COMMENT '优惠码优惠金额',
  `total_coupon_discount` decimal(10,2) DEFAULT '0.00' COMMENT '红包优惠金额',
  `total_amount` decimal(10,2) DEFAULT '0.00' COMMENT '付款金额',
  `give_point` int(10) DEFAULT '0' COMMENT '获得悦享钱',
  `total_points` decimal(10,2) DEFAULT '0.00' COMMENT '使用悦享钱数量',
  `combile` tinyint(1) DEFAULT '0' COMMENT '是否更新促销规则',
  `created_at` timestamp NULL DEFAULT NULL COMMENT '创建时间',
  `updated_at` timestamp NULL DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`) USING BTREE,
  KEY `wechat_id` (`wechat_id`) USING BTREE,
  KEY `origin` (`origin`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci ROW_FORMAT=DYNAMIC COMMENT='购物车表';

/*Data for the table `cart` */

/*Table structure for table `cart_items` */

DROP TABLE IF EXISTS `cart_items`;

CREATE TABLE `cart_items` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '购物车ID',
  `cart_id` int(11) DEFAULT NULL COMMENT '购物车id',
  `customer_id` char(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '周友账户id',
  `spu_id` char(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'spu',
  `name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品名称',
  `image` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '图片地址',
  `sku_id` char(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'sku',
  `style_number` char(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '款号 ',
  `model_number` char(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'model number',
  `metarial` char(20) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '材质',
  `product_type` char(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '类别',
  `price_type` char(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '价格类型   定价  计价 Y',
  `inventory` int(11) DEFAULT '1' COMMENT '商品数',
  `gold_price` decimal(10,2) DEFAULT '0.00' COMMENT '当前金价',
  `weight` varchar(10) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '重量',
  `origin_price` decimal(10,2) DEFAULT '0.00' COMMENT '商品原价',
  `price` decimal(10,2) DEFAULT '0.00' COMMENT '商品价格',
  `final_price` decimal(10,2) DEFAULT NULL COMMENT '最终价格',
  `labor_price` decimal(10,2) DEFAULT '0.00' COMMENT '工费',
  `promotion_type` char(20) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT 'pro 折扣   member 会员 point 悦享钱  auto ',
  `promotion_money` decimal(10,2) DEFAULT '0.00' COMMENT '促销优惠金额',
  `promotion_sale` decimal(10,2) DEFAULT '0.00' COMMENT '已享受的，促销，满减，优惠金额',
  `promotion_member` decimal(10,2) DEFAULT '0.00' COMMENT '会员优惠',
  `promotion_discount` decimal(10,2) DEFAULT '0.00' COMMENT '已享受的，促销，打折，优惠金额',
  `promotion_code` decimal(10,2) DEFAULT '0.00' COMMENT '优惠码优惠金额',
  `promotion_point` decimal(10,2) DEFAULT '0.00' COMMENT '悦享钱 对应优惠金额',
  `give_point` int(10) DEFAULT '0' COMMENT '获得悦享钱数量',
  `point` int(10) DEFAULT '0' COMMENT '使用悦享钱数量',
  `discount` decimal(10,2) DEFAULT '0.00' COMMENT '优惠金额',
  `applied_coupon` char(10) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '是否应用红包',
  `applied_cut` char(10) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '是否应用满减',
  `applied_member` char(10) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '是否应用会员折扣',
  `applied_discount` char(10) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '是否应用折扣',
  `applied_rule_ids` text COLLATE utf8mb4_unicode_ci COMMENT '应用的优惠集合',
  `applied_gift` char(10) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '是否应用赠品',
  `applied_point` char(10) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '是否可用悦享钱',
  `lottery_font` tinyint(1) DEFAULT '1' COMMENT '字体，1roma2是arial',
  `content` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '刻字内容',
  `max_length` tinyint(3) DEFAULT NULL COMMENT '刻字长度限制',
  `next_tips` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '凑单显示',
  `is_able` int(1) DEFAULT '1' COMMENT ' 1  正常   2   当前sku已售罄  3   spu 产品全售罄',
  `is_gift` tinyint(1) DEFAULT '0' COMMENT '是否为赠品   1   是    0   不是',
  `is_charme` tinyint(1) DEFAULT '0' COMMENT '0   普通产品   1    手绳（不需要提交oms锁库存）',
  `is_service` tinyint(1) DEFAULT '0' COMMENT '是否可退换货   0  否  1  是',
  `is_lettory` tinyint(1) DEFAULT NULL COMMENT '是否可刻字',
  `presale_time` timestamp NULL DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP COMMENT '预售时间',
  `pid` int(10) DEFAULT NULL COMMENT 'sku_id',
  `guide` char(20) CHARACTER SET utf8mb4 DEFAULT NULL COMMENT '导购id',
  `channel` varchar(20) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '渠道id',
  `store_code` varchar(20) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'guide 对应门店id',
  `created_at` timestamp NULL DEFAULT NULL COMMENT '创建时间',
  `updated_at` timestamp NULL DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`) USING BTREE,
  KEY `is_able` (`is_able`) USING BTREE,
  KEY `cart_id` (`cart_id`) USING BTREE,
  KEY `custid` (`customer_id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci ROW_FORMAT=DYNAMIC;

/*Data for the table `cart_items` */

/*Table structure for table `diff` */

DROP TABLE IF EXISTS `diff`;

CREATE TABLE `diff` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '自增id',
  `diff_total_price` float DEFAULT NULL COMMENT '差价总价',
  `diff_total_skus` varchar(200) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '差价总sku,逗号分隔',
  `pay_real_sn` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '支付时传给收钱吧商城订单号 ',
  `diff_pay_flag` tinyint(2) DEFAULT '0' COMMENT '是否支付',
  `diff_pay_tid` varchar(200) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '支付交易号',
  `diff_pay_time` datetime DEFAULT NULL COMMENT '支付时间',
  `diff_oms_input_time` datetime DEFAULT NULL COMMENT 'oms推送过来的时间',
  `order_sn` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '订单号',
  `flag_push_oms` tinyint(2) DEFAULT '0' COMMENT '是否推送到oms',
  `push_oms_time` datetime DEFAULT NULL COMMENT '支付差价后推送到oms时间',
  `flag_expire` tinyint(2) DEFAULT '0' COMMENT '是否过期没有支付',
  `flag_expire_push_oms` tinyint(2) DEFAULT '0' COMMENT '过期是否推送给oms',
  `expire_push_oms_time` datetime DEFAULT NULL COMMENT '过期没有补差价，推送oms时间',
  `created_at` timestamp NULL DEFAULT NULL COMMENT '创建时间',
  `updated_at` timestamp NULL DEFAULT NULL COMMENT '更新时间',
  `diff_earn_points` float DEFAULT NULL COMMENT '差价的赚取的悦享钱',
  `diff_refund_flag` tinyint(2) DEFAULT '0' COMMENT '差价退款',
  `diff_refund_time` datetime DEFAULT NULL COMMENT '退款时间',
  `diff_refund_amount` float DEFAULT NULL COMMENT '退款金额',
  `diff_refund_times` int(11) DEFAULT '0' COMMENT '退款次数',
  UNIQUE KEY `id` (`id`) USING BTREE,
  KEY `order_sn` (`order_sn`(191)) USING BTREE,
  KEY `pay_flag_index` (`diff_pay_flag`) USING BTREE,
  KEY `flag_push_oms_index` (`flag_push_oms`) USING BTREE,
  KEY `flag_expire_push_oms_index` (`flag_expire_push_oms`) USING BTREE,
  KEY `created_at_index` (`created_at`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin ROW_FORMAT=DYNAMIC;

/*Data for the table `diff` */

/*Table structure for table `diff_items` */

DROP TABLE IF EXISTS `diff_items`;

CREATE TABLE `diff_items` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '自增id',
  `order_sn` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '订单号',
  `line_nbr` int(11) DEFAULT NULL COMMENT '订单行，对应oms',
  `sku` varchar(200) COLLATE utf8mb4_bin DEFAULT NULL COMMENT 'sku',
  `diff_price` float DEFAULT NULL COMMENT '差价',
  `created_at` timestamp NULL DEFAULT NULL COMMENT '创建时间',
  `updated_at` timestamp NULL DEFAULT NULL COMMENT '更新时间',
  `diff_text` varchar(500) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '差价新的sku的属性和值',
  `diff_refund_flag` tinyint(2) DEFAULT '0' COMMENT '差价退款',
  `diff_refund_time` datetime DEFAULT NULL COMMENT '退款时间',
  `diff_refund_amount` float DEFAULT NULL COMMENT '退款金额',
  UNIQUE KEY `id` (`id`) USING BTREE,
  KEY `order_sn` (`order_sn`(191)) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin ROW_FORMAT=DYNAMIC;

/*Data for the table `diff_items` */

/*Table structure for table `dlc_invoice` */

DROP TABLE IF EXISTS `dlc_invoice`;

CREATE TABLE `dlc_invoice` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `order_sn` varchar(50) COLLATE utf8mb4_bin NOT NULL COMMENT '订单号',
  `invoice_id` varchar(10) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '发票id',
  `pdf_url` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '发票下载地址',
  `invoice_code` varchar(50) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '发票代码',
  `invoice_no` varchar(50) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '发票号码',
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `email` varchar(50) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '电子邮箱',
  `mobile` varchar(30) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '手机号',
  `status` tinyint(1) DEFAULT '0' COMMENT '0 未发送,1 已发送',
  `uid` int(10) NOT NULL COMMENT '用户ID',
  `title` varchar(100) COLLATE utf8mb4_bin NOT NULL COMMENT '发票抬头',
  `type` varchar(50) COLLATE utf8mb4_bin NOT NULL DEFAULT '0' COMMENT '个人|企业',
  `number` varchar(50) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '纳税人识别号',
  PRIMARY KEY (`id`),
  UNIQUE KEY `order_sn_u` (`order_sn`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

/*Data for the table `dlc_invoice` */

/*Table structure for table `dlc_oms_address` */

DROP TABLE IF EXISTS `dlc_oms_address`;

CREATE TABLE `dlc_oms_address` (
  `province` varchar(50) COLLATE utf8mb4_bin NOT NULL,
  `city` varchar(50) COLLATE utf8mb4_bin NOT NULL,
  `district` varchar(50) COLLATE utf8mb4_bin NOT NULL,
  UNIQUE KEY `pcd_u` (`province`,`city`,`district`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

/*Data for the table `dlc_oms_address` */

insert  into `dlc_oms_address`(`province`,`city`,`district`) values ('上海','上海市','嘉定区'),('上海','上海市','奉贤区'),('上海','上海市','宝山区'),('上海','上海市','崇明县'),('上海','上海市','徐汇区'),('上海','上海市','普陀区'),('上海','上海市','杨浦区'),('上海','上海市','松江区'),('上海','上海市','浦东新区'),('上海','上海市','虹口区'),('上海','上海市','金山区'),('上海','上海市','长宁区'),('上海','上海市','闵行区'),('上海','上海市','闸北区'),('上海','上海市','青浦区'),('上海','上海市','静安区'),('上海','上海市','黄浦区'),('云南省','临沧市','临翔区'),('云南省','临沧市','云县'),('云南省','临沧市','凤庆县'),('云南省','临沧市','双江拉祜族佤族布朗族傣族自治县'),('云南省','临沧市','永德县'),('云南省','临沧市','沧源佤族自治县'),('云南省','临沧市','耿马傣族佤族自治县'),('云南省','临沧市','镇康县'),('云南省','丽江市','华坪县'),('云南省','丽江市','古城区'),('云南省','丽江市','宁蒗彝族自治县'),('云南省','丽江市','永胜县'),('云南省','丽江市','玉龙纳西族自治县'),('云南省','保山市','施甸县'),('云南省','保山市','昌宁县'),('云南省','保山市','腾冲县'),('云南省','保山市','隆阳区'),('云南省','保山市','龙陵县'),('云南省','大理白族自治州','云龙县'),('云南省','大理白族自治州','剑川县'),('云南省','大理白族自治州','南涧彝族自治县'),('云南省','大理白族自治州','大理市'),('云南省','大理白族自治州','宾川县'),('云南省','大理白族自治州','巍山彝族回族自治县'),('云南省','大理白族自治州','弥渡县'),('云南省','大理白族自治州','永平县'),('云南省','大理白族自治州','洱源县'),('云南省','大理白族自治州','漾濞彝族自治县'),('云南省','大理白族自治州','祥云县'),('云南省','大理白族自治州','鹤庆县'),('云南省','德宏傣族景颇族自治州','梁河县'),('云南省','德宏傣族景颇族自治州','瑞丽市'),('云南省','德宏傣族景颇族自治州','盈江县'),('云南省','德宏傣族景颇族自治州','芒市'),('云南省','德宏傣族景颇族自治州','陇川县'),('云南省','怒江傈僳族自治州','兰坪白族普米族自治县'),('云南省','怒江傈僳族自治州','泸水县'),('云南省','怒江傈僳族自治州','福贡县'),('云南省','怒江傈僳族自治州','贡山独龙族怒族自治县'),('云南省','文山壮族苗族自治州','丘北县'),('云南省','文山壮族苗族自治州','富宁县'),('云南省','文山壮族苗族自治州','广南县'),('云南省','文山壮族苗族自治州','文山市'),('云南省','文山壮族苗族自治州','砚山县'),('云南省','文山壮族苗族自治州','西畴县'),('云南省','文山壮族苗族自治州','马关县'),('云南省','文山壮族苗族自治州','麻栗坡县'),('云南省','昆明市','东川区'),('云南省','昆明市','五华区'),('云南省','昆明市','呈贡区'),('云南省','昆明市','安宁市'),('云南省','昆明市','官渡区'),('云南省','昆明市','宜良县'),('云南省','昆明市','富民县'),('云南省','昆明市','寻甸回族彝族自治县'),('云南省','昆明市','嵩明县'),('云南省','昆明市','晋宁县'),('云南省','昆明市','盘龙区'),('云南省','昆明市','石林彝族自治县'),('云南省','昆明市','禄劝彝族苗族自治县'),('云南省','昆明市','西山区'),('云南省','昭通市','大关县'),('云南省','昭通市','威信县'),('云南省','昭通市','巧家县'),('云南省','昭通市','彝良县'),('云南省','昭通市','昭阳区'),('云南省','昭通市','水富县'),('云南省','昭通市','永善县'),('云南省','昭通市','盐津县'),('云南省','昭通市','绥江县'),('云南省','昭通市','镇雄县'),('云南省','昭通市','鲁甸县'),('云南省','普洱市','墨江哈尼族自治县'),('云南省','普洱市','孟连傣族拉祜族佤族自治县'),('云南省','普洱市','宁洱哈尼族彝族自治县'),('云南省','普洱市','思茅区'),('云南省','普洱市','景东彝族自治县'),('云南省','普洱市','景谷傣族彝族自治县'),('云南省','普洱市','江城哈尼族彝族自治县'),('云南省','普洱市','澜沧拉祜族自治县'),('云南省','普洱市','西盟佤族自治县'),('云南省','普洱市','镇沅彝族哈尼族拉祜族自治县'),('云南省','曲靖市','会泽县'),('云南省','曲靖市','宣威市'),('云南省','曲靖市','富源县'),('云南省','曲靖市','师宗县'),('云南省','曲靖市','沾益县'),('云南省','曲靖市','罗平县'),('云南省','曲靖市','陆良县'),('云南省','曲靖市','马龙县'),('云南省','曲靖市','麒麟区'),('云南省','楚雄彝族自治州','元谋县'),('云南省','楚雄彝族自治州','南华县'),('云南省','楚雄彝族自治州','双柏县'),('云南省','楚雄彝族自治州','大姚县'),('云南省','楚雄彝族自治州','姚安县'),('云南省','楚雄彝族自治州','楚雄市'),('云南省','楚雄彝族自治州','武定县'),('云南省','楚雄彝族自治州','永仁县'),('云南省','楚雄彝族自治州','牟定县'),('云南省','楚雄彝族自治州','禄丰县'),('云南省','玉溪市','元江哈尼族彝族傣族自治县'),('云南省','玉溪市','华宁县'),('云南省','玉溪市','峨山彝族自治县'),('云南省','玉溪市','新平彝族傣族自治县'),('云南省','玉溪市','易门县'),('云南省','玉溪市','江川县'),('云南省','玉溪市','澄江县'),('云南省','玉溪市','红塔区'),('云南省','玉溪市','通海县'),('云南省','红河哈尼族彝族自治州','个旧市'),('云南省','红河哈尼族彝族自治州','元阳县'),('云南省','红河哈尼族彝族自治州','屏边苗族自治县'),('云南省','红河哈尼族彝族自治州','建水县'),('云南省','红河哈尼族彝族自治州','开远市'),('云南省','红河哈尼族彝族自治州','弥勒县'),('云南省','红河哈尼族彝族自治州','河口瑶族自治县'),('云南省','红河哈尼族彝族自治州','泸西县'),('云南省','红河哈尼族彝族自治州','石屏县'),('云南省','红河哈尼族彝族自治州','红河县'),('云南省','红河哈尼族彝族自治州','绿春县'),('云南省','红河哈尼族彝族自治州','蒙自市'),('云南省','红河哈尼族彝族自治州','金平苗族瑶族傣族自治县'),('云南省','西双版纳傣族自治州','勐海县'),('云南省','西双版纳傣族自治州','勐腊县'),('云南省','西双版纳傣族自治州','景洪市'),('云南省','迪庆藏族自治州','德钦县'),('云南省','迪庆藏族自治州','维西傈僳族自治县'),('云南省','迪庆藏族自治州','香格里拉县'),('内蒙古自治区','乌兰察布市','丰镇市'),('内蒙古自治区','乌兰察布市','兴和县'),('内蒙古自治区','乌兰察布市','凉城县'),('内蒙古自治区','乌兰察布市','化德县'),('内蒙古自治区','乌兰察布市','卓资县'),('内蒙古自治区','乌兰察布市','商都县'),('内蒙古自治区','乌兰察布市','四子王旗'),('内蒙古自治区','乌兰察布市','察哈尔右翼中旗'),('内蒙古自治区','乌兰察布市','察哈尔右翼前旗'),('内蒙古自治区','乌兰察布市','察哈尔右翼后旗'),('内蒙古自治区','乌兰察布市','集宁区'),('内蒙古自治区','乌海市','乌达区'),('内蒙古自治区','乌海市','海勃湾区'),('内蒙古自治区','乌海市','海南区'),('内蒙古自治区','兴安盟','乌兰浩特市'),('内蒙古自治区','兴安盟','扎赉特旗'),('内蒙古自治区','兴安盟','科尔沁右翼中旗'),('内蒙古自治区','兴安盟','科尔沁右翼前旗'),('内蒙古自治区','兴安盟','突泉县'),('内蒙古自治区','兴安盟','阿尔山市'),('内蒙古自治区','包头市','东河区'),('内蒙古自治区','包头市','九原区'),('内蒙古自治区','包头市','固阳县'),('内蒙古自治区','包头市','土默特右旗'),('内蒙古自治区','包头市','昆都仑区'),('内蒙古自治区','包头市','白云鄂博矿区'),('内蒙古自治区','包头市','石拐区'),('内蒙古自治区','包头市','达尔罕茂明安联合旗'),('内蒙古自治区','包头市','青山区'),('内蒙古自治区','呼伦贝尔市','扎兰屯市'),('内蒙古自治区','呼伦贝尔市','新巴尔虎右旗'),('内蒙古自治区','呼伦贝尔市','新巴尔虎左旗'),('内蒙古自治区','呼伦贝尔市','根河市'),('内蒙古自治区','呼伦贝尔市','海拉尔区'),('内蒙古自治区','呼伦贝尔市','满洲里市'),('内蒙古自治区','呼伦贝尔市','牙克石市'),('内蒙古自治区','呼伦贝尔市','莫力达瓦达斡尔族自治旗'),('内蒙古自治区','呼伦贝尔市','鄂伦春自治旗'),('内蒙古自治区','呼伦贝尔市','鄂温克族自治旗'),('内蒙古自治区','呼伦贝尔市','阿荣旗'),('内蒙古自治区','呼伦贝尔市','陈巴尔虎旗'),('内蒙古自治区','呼伦贝尔市','额尔古纳市'),('内蒙古自治区','呼和浩特市','和林格尔县'),('内蒙古自治区','呼和浩特市','回民区'),('内蒙古自治区','呼和浩特市','土默特左旗'),('内蒙古自治区','呼和浩特市','托克托县'),('内蒙古自治区','呼和浩特市','新城区'),('内蒙古自治区','呼和浩特市','武川县'),('内蒙古自治区','呼和浩特市','清水河县'),('内蒙古自治区','呼和浩特市','玉泉区'),('内蒙古自治区','呼和浩特市','赛罕区'),('内蒙古自治区','巴彦淖尔市','临河区'),('内蒙古自治区','巴彦淖尔市','乌拉特中旗'),('内蒙古自治区','巴彦淖尔市','乌拉特前旗'),('内蒙古自治区','巴彦淖尔市','乌拉特后旗'),('内蒙古自治区','巴彦淖尔市','五原县'),('内蒙古自治区','巴彦淖尔市','杭锦后旗'),('内蒙古自治区','巴彦淖尔市','磴口县'),('内蒙古自治区','赤峰市','元宝山区'),('内蒙古自治区','赤峰市','克什克腾旗'),('内蒙古自治区','赤峰市','喀喇沁旗'),('内蒙古自治区','赤峰市','宁城县'),('内蒙古自治区','赤峰市','巴林右旗'),('内蒙古自治区','赤峰市','巴林左旗'),('内蒙古自治区','赤峰市','敖汉旗'),('内蒙古自治区','赤峰市','松山区'),('内蒙古自治区','赤峰市','林西县'),('内蒙古自治区','赤峰市','红山区'),('内蒙古自治区','赤峰市','翁牛特旗'),('内蒙古自治区','赤峰市','阿鲁科尔沁旗'),('内蒙古自治区','通辽市','奈曼旗'),('内蒙古自治区','通辽市','库伦旗'),('内蒙古自治区','通辽市','开鲁县'),('内蒙古自治区','通辽市','扎鲁特旗'),('内蒙古自治区','通辽市','科尔沁区'),('内蒙古自治区','通辽市','科尔沁左翼中旗'),('内蒙古自治区','通辽市','科尔沁左翼后旗'),('内蒙古自治区','通辽市','霍林郭勒市'),('内蒙古自治区','鄂尔多斯市','东胜区'),('内蒙古自治区','鄂尔多斯市','乌审旗'),('内蒙古自治区','鄂尔多斯市','伊金霍洛旗'),('内蒙古自治区','鄂尔多斯市','准格尔旗'),('内蒙古自治区','鄂尔多斯市','杭锦旗'),('内蒙古自治区','鄂尔多斯市','达拉特旗'),('内蒙古自治区','鄂尔多斯市','鄂托克前旗'),('内蒙古自治区','鄂尔多斯市','鄂托克旗'),('内蒙古自治区','锡林郭勒盟','东乌珠穆沁旗'),('内蒙古自治区','锡林郭勒盟','二连浩特市'),('内蒙古自治区','锡林郭勒盟','多伦县'),('内蒙古自治区','锡林郭勒盟','太仆寺旗'),('内蒙古自治区','锡林郭勒盟','正蓝旗'),('内蒙古自治区','锡林郭勒盟','正镶白旗'),('内蒙古自治区','锡林郭勒盟','苏尼特右旗'),('内蒙古自治区','锡林郭勒盟','苏尼特左旗'),('内蒙古自治区','锡林郭勒盟','西乌珠穆沁旗'),('内蒙古自治区','锡林郭勒盟','锡林浩特市'),('内蒙古自治区','锡林郭勒盟','镶黄旗'),('内蒙古自治区','锡林郭勒盟','阿巴嘎旗'),('内蒙古自治区','阿拉善盟','阿拉善右旗'),('内蒙古自治区','阿拉善盟','阿拉善左旗'),('内蒙古自治区','阿拉善盟','额济纳旗'),('北京','北京市','东城区'),('北京','北京市','丰台区'),('北京','北京市','大兴区'),('北京','北京市','密云县'),('北京','北京市','平谷区'),('北京','北京市','延庆县'),('北京','北京市','怀柔区'),('北京','北京市','房山区'),('北京','北京市','昌平区'),('北京','北京市','朝阳区'),('北京','北京市','海淀区'),('北京','北京市','石景山区'),('北京','北京市','西城区'),('北京','北京市','通州区'),('北京','北京市','门头沟区'),('北京','北京市','顺义区'),('吉林省','吉林市','丰满区'),('吉林省','吉林市','昌邑区'),('吉林省','吉林市','桦甸市'),('吉林省','吉林市','永吉县'),('吉林省','吉林市','磐石市'),('吉林省','吉林市','舒兰市'),('吉林省','吉林市','船营区'),('吉林省','吉林市','蛟河市'),('吉林省','吉林市','龙潭区'),('吉林省','四平市','伊通满族自治县'),('吉林省','四平市','公主岭市'),('吉林省','四平市','双辽市'),('吉林省','四平市','梨树县'),('吉林省','四平市','铁东区'),('吉林省','四平市','铁西区'),('吉林省','延边朝鲜族自治州','和龙市'),('吉林省','延边朝鲜族自治州','图们市'),('吉林省','延边朝鲜族自治州','安图县'),('吉林省','延边朝鲜族自治州','延吉市'),('吉林省','延边朝鲜族自治州','敦化市'),('吉林省','延边朝鲜族自治州','汪清县'),('吉林省','延边朝鲜族自治州','珲春市'),('吉林省','延边朝鲜族自治州','龙井市'),('吉林省','松原市','乾安县'),('吉林省','松原市','前郭尔罗斯蒙古族自治县'),('吉林省','松原市','宁江区'),('吉林省','松原市','扶余市'),('吉林省','松原市','长岭县'),('吉林省','白城市','大安市'),('吉林省','白城市','洮北区'),('吉林省','白城市','洮南市'),('吉林省','白城市','通榆县'),('吉林省','白城市','镇赉县'),('吉林省','白山市','临江市'),('吉林省','白山市','抚松县'),('吉林省','白山市','江源区'),('吉林省','白山市','浑江区'),('吉林省','白山市','长白朝鲜族自治县'),('吉林省','白山市','靖宇县'),('吉林省','辽源市','东丰县'),('吉林省','辽源市','东辽县'),('吉林省','辽源市','西安区'),('吉林省','辽源市','龙山区'),('吉林省','通化市','东昌区'),('吉林省','通化市','二道江区'),('吉林省','通化市','柳河县'),('吉林省','通化市','梅河口市'),('吉林省','通化市','辉南县'),('吉林省','通化市','通化县'),('吉林省','通化市','集安市'),('吉林省','长春市','九台市'),('吉林省','长春市','二道区'),('吉林省','长春市','农安县'),('吉林省','长春市','净月潭旅游经济开发区'),('吉林省','长春市','南关区'),('吉林省','长春市','双阳区'),('吉林省','长春市','宽城区'),('吉林省','长春市','德惠市'),('吉林省','长春市','朝阳区'),('吉林省','长春市','榆树市'),('吉林省','长春市','经济技术产业开发区'),('吉林省','长春市','绿园区'),('吉林省','长春市','长春汽车产业开发区'),('四川省','乐山市','五通桥区'),('四川省','乐山市','井研县'),('四川省','乐山市','夹江县'),('四川省','乐山市','峨眉山市'),('四川省','乐山市','峨边彝族自治县'),('四川省','乐山市','市中区'),('四川省','乐山市','沐川县'),('四川省','乐山市','沙湾区'),('四川省','乐山市','犍为县'),('四川省','乐山市','金口河区'),('四川省','乐山市','马边彝族自治县'),('四川省','内江市','东兴区'),('四川省','内江市','威远县'),('四川省','内江市','市中区'),('四川省','内江市','资中县'),('四川省','内江市','隆昌县'),('四川省','凉山彝族自治州','会东县'),('四川省','凉山彝族自治州','会理县'),('四川省','凉山彝族自治州','冕宁县'),('四川省','凉山彝族自治州','喜德县'),('四川省','凉山彝族自治州','宁南县'),('四川省','凉山彝族自治州','布拖县'),('四川省','凉山彝族自治州','德昌县'),('四川省','凉山彝族自治州','昭觉县'),('四川省','凉山彝族自治州','普格县'),('四川省','凉山彝族自治州','木里藏族自治县'),('四川省','凉山彝族自治州','甘洛县'),('四川省','凉山彝族自治州','盐源县'),('四川省','凉山彝族自治州','美姑县'),('四川省','凉山彝族自治州','西昌市'),('四川省','凉山彝族自治州','越西县'),('四川省','凉山彝族自治州','金阳县'),('四川省','凉山彝族自治州','雷波县'),('四川省','南充市','仪陇县'),('四川省','南充市','南部县'),('四川省','南充市','嘉陵区'),('四川省','南充市','营山县'),('四川省','南充市','蓬安县'),('四川省','南充市','西充县'),('四川省','南充市','阆中市'),('四川省','南充市','顺庆区'),('四川省','南充市','高坪区'),('四川省','宜宾市','兴文县'),('四川省','宜宾市','南溪区'),('四川省','宜宾市','宜宾县'),('四川省','宜宾市','屏山县'),('四川省','宜宾市','江安县'),('四川省','宜宾市','珙县'),('四川省','宜宾市','筠连县'),('四川省','宜宾市','翠屏区'),('四川省','宜宾市','长宁县'),('四川省','宜宾市','高县'),('四川省','巴中市','南江县'),('四川省','巴中市','巴州区'),('四川省','巴中市','平昌县'),('四川省','巴中市','恩阳区'),('四川省','巴中市','通江县'),('四川省','广元市','利州区'),('四川省','广元市','剑阁县'),('四川省','广元市','旺苍县'),('四川省','广元市','昭化区'),('四川省','广元市','朝天区'),('四川省','广元市','苍溪县'),('四川省','广元市','青川县'),('四川省','广安市','前锋区'),('四川省','广安市','华蓥市'),('四川省','广安市','岳池县'),('四川省','广安市','广安区'),('四川省','广安市','武胜县'),('四川省','广安市','邻水县'),('四川省','德阳市','中江县'),('四川省','德阳市','什邡市'),('四川省','德阳市','广汉市'),('四川省','德阳市','旌阳区'),('四川省','德阳市','绵竹市'),('四川省','德阳市','罗江县'),('四川省','成都市','双流县'),('四川省','成都市','大邑县'),('四川省','成都市','崇州市'),('四川省','成都市','彭州市'),('四川省','成都市','成华区'),('四川省','成都市','新津县'),('四川省','成都市','新都区'),('四川省','成都市','武侯区'),('四川省','成都市','温江区'),('四川省','成都市','蒲江县'),('四川省','成都市','邛崃市'),('四川省','成都市','郫县'),('四川省','成都市','都江堰市'),('四川省','成都市','金堂县'),('四川省','成都市','金牛区'),('四川省','成都市','锦江区'),('四川省','成都市','青白江区'),('四川省','成都市','青羊区'),('四川省','成都市','龙泉驿区'),('四川省','攀枝花市','东区'),('四川省','攀枝花市','仁和区'),('四川省','攀枝花市','盐边县'),('四川省','攀枝花市','米易县'),('四川省','攀枝花市','西区'),('四川省','泸州市','叙永县'),('四川省','泸州市','古蔺县'),('四川省','泸州市','合江县'),('四川省','泸州市','江阳区'),('四川省','泸州市','泸县'),('四川省','泸州市','纳溪区'),('四川省','泸州市','龙马潭区'),('四川省','甘孜藏族自治州','丹巴县'),('四川省','甘孜藏族自治州','九龙县'),('四川省','甘孜藏族自治州','乡城县'),('四川省','甘孜藏族自治州','巴塘县'),('四川省','甘孜藏族自治州','康定县'),('四川省','甘孜藏族自治州','得荣县'),('四川省','甘孜藏族自治州','德格县'),('四川省','甘孜藏族自治州','新龙县'),('四川省','甘孜藏族自治州','泸定县'),('四川省','甘孜藏族自治州','炉霍县'),('四川省','甘孜藏族自治州','理塘县'),('四川省','甘孜藏族自治州','甘孜县'),('四川省','甘孜藏族自治州','白玉县'),('四川省','甘孜藏族自治州','石渠县'),('四川省','甘孜藏族自治州','稻城县'),('四川省','甘孜藏族自治州','色达县'),('四川省','甘孜藏族自治州','道孚县'),('四川省','甘孜藏族自治州','雅江县'),('四川省','眉山市','东坡区'),('四川省','眉山市','丹棱县'),('四川省','眉山市','仁寿县'),('四川省','眉山市','彭山县'),('四川省','眉山市','洪雅县'),('四川省','眉山市','青神县'),('四川省','绵阳市','三台县'),('四川省','绵阳市','北川羌族自治县'),('四川省','绵阳市','安县'),('四川省','绵阳市','平武县'),('四川省','绵阳市','梓潼县'),('四川省','绵阳市','江油市'),('四川省','绵阳市','涪城区'),('四川省','绵阳市','游仙区'),('四川省','绵阳市','盐亭县'),('四川省','自贡市','大安区'),('四川省','自贡市','富顺县'),('四川省','自贡市','沿滩区'),('四川省','自贡市','自流井区'),('四川省','自贡市','荣县'),('四川省','自贡市','贡井区'),('四川省','资阳市','乐至县'),('四川省','资阳市','安岳县'),('四川省','资阳市','简阳市'),('四川省','资阳市','雁江区'),('四川省','达州市','万源市'),('四川省','达州市','大竹县'),('四川省','达州市','宣汉县'),('四川省','达州市','开江县'),('四川省','达州市','渠县'),('四川省','达州市','达县'),('四川省','达州市','通川区'),('四川省','遂宁市','大英县'),('四川省','遂宁市','安居区'),('四川省','遂宁市','射洪县'),('四川省','遂宁市','船山区'),('四川省','遂宁市','蓬溪县'),('四川省','阿坝藏族羌族自治州','九寨沟县'),('四川省','阿坝藏族羌族自治州','壤塘县'),('四川省','阿坝藏族羌族自治州','小金县'),('四川省','阿坝藏族羌族自治州','松潘县'),('四川省','阿坝藏族羌族自治州','汶川县'),('四川省','阿坝藏族羌族自治州','理县'),('四川省','阿坝藏族羌族自治州','红原县'),('四川省','阿坝藏族羌族自治州','若尔盖县'),('四川省','阿坝藏族羌族自治州','茂县'),('四川省','阿坝藏族羌族自治州','金川县'),('四川省','阿坝藏族羌族自治州','阿坝县'),('四川省','阿坝藏族羌族自治州','马尔康县'),('四川省','阿坝藏族羌族自治州','黑水县'),('四川省','雅安市','名山区'),('四川省','雅安市','天全县'),('四川省','雅安市','宝兴县'),('四川省','雅安市','汉源县'),('四川省','雅安市','石棉县'),('四川省','雅安市','芦山县'),('四川省','雅安市','荥经县'),('四川省','雅安市','雨城区'),('天津','天津市','东丽区'),('天津','天津市','北辰区'),('天津','天津市','南开区'),('天津','天津市','和平区'),('天津','天津市','宁河县'),('天津','天津市','宝坻区'),('天津','天津市','武清区'),('天津','天津市','河东区'),('天津','天津市','河北区'),('天津','天津市','河西区'),('天津','天津市','津南区'),('天津','天津市','滨海新区'),('天津','天津市','红桥区'),('天津','天津市','蓟县'),('天津','天津市','西青区'),('天津','天津市','静海县'),('宁夏回族自治区','中卫市','中宁县'),('宁夏回族自治区','中卫市','沙坡头区'),('宁夏回族自治区','中卫市','海原县'),('宁夏回族自治区','吴忠市','利通区'),('宁夏回族自治区','吴忠市','同心县'),('宁夏回族自治区','吴忠市','盐池县'),('宁夏回族自治区','吴忠市','红寺堡区'),('宁夏回族自治区','吴忠市','青铜峡市'),('宁夏回族自治区','固原市','原州区'),('宁夏回族自治区','固原市','彭阳县'),('宁夏回族自治区','固原市','泾源县'),('宁夏回族自治区','固原市','西吉县'),('宁夏回族自治区','固原市','隆德县'),('宁夏回族自治区','石嘴山市','大武口区'),('宁夏回族自治区','石嘴山市','平罗县'),('宁夏回族自治区','石嘴山市','惠农区'),('宁夏回族自治区','银川市','兴庆区'),('宁夏回族自治区','银川市','永宁县'),('宁夏回族自治区','银川市','灵武市'),('宁夏回族自治区','银川市','西夏区'),('宁夏回族自治区','银川市','贺兰县'),('宁夏回族自治区','银川市','金凤区'),('安徽省','亳州市','利辛县'),('安徽省','亳州市','涡阳县'),('安徽省','亳州市','蒙城县'),('安徽省','亳州市','谯城区'),('安徽省','六安市','寿县'),('安徽省','六安市','舒城县'),('安徽省','六安市','裕安区'),('安徽省','六安市','金安区'),('安徽省','六安市','金寨县'),('安徽省','六安市','霍山县'),('安徽省','六安市','霍邱县'),('安徽省','合肥市','包河区'),('安徽省','合肥市','巢湖市'),('安徽省','合肥市','庐江县'),('安徽省','合肥市','庐阳区'),('安徽省','合肥市','瑶海区'),('安徽省','合肥市','肥东县'),('安徽省','合肥市','肥西县'),('安徽省','合肥市','蜀山区'),('安徽省','合肥市','长丰县'),('安徽省','安庆市','大观区'),('安徽省','安庆市','太湖县'),('安徽省','安庆市','宜秀区'),('安徽省','安庆市','宿松县'),('安徽省','安庆市','岳西县'),('安徽省','安庆市','怀宁县'),('安徽省','安庆市','望江县'),('安徽省','安庆市','枞阳县'),('安徽省','安庆市','桐城市'),('安徽省','安庆市','潜山县'),('安徽省','安庆市','迎江区'),('安徽省','宣城市','宁国市'),('安徽省','宣城市','宣州区'),('安徽省','宣城市','广德县'),('安徽省','宣城市','旌德县'),('安徽省','宣城市','泾县'),('安徽省','宣城市','绩溪县'),('安徽省','宣城市','郎溪县'),('安徽省','宿州市','埇桥区'),('安徽省','宿州市','泗县'),('安徽省','宿州市','灵璧县'),('安徽省','宿州市','砀山县'),('安徽省','宿州市','萧县'),('安徽省','池州市','东至县'),('安徽省','池州市','石台县'),('安徽省','池州市','贵池区'),('安徽省','池州市','青阳县'),('安徽省','淮北市','杜集区'),('安徽省','淮北市','濉溪县'),('安徽省','淮北市','烈山区'),('安徽省','淮北市','相山区'),('安徽省','淮南市','八公山区'),('安徽省','淮南市','凤台县'),('安徽省','淮南市','大通区'),('安徽省','淮南市','潘集区'),('安徽省','淮南市','田家庵区'),('安徽省','淮南市','谢家集区'),('安徽省','滁州市','全椒县'),('安徽省','滁州市','凤阳县'),('安徽省','滁州市','南谯区'),('安徽省','滁州市','天长市'),('安徽省','滁州市','定远县'),('安徽省','滁州市','明光市'),('安徽省','滁州市','来安县'),('安徽省','滁州市','琅琊区'),('安徽省','芜湖市','三山区'),('安徽省','芜湖市','南陵县'),('安徽省','芜湖市','弋江区'),('安徽省','芜湖市','无为县'),('安徽省','芜湖市','繁昌县'),('安徽省','芜湖市','芜湖县'),('安徽省','芜湖市','镜湖区'),('安徽省','芜湖市','鸠江区'),('安徽省','蚌埠市','五河县'),('安徽省','蚌埠市','固镇县'),('安徽省','蚌埠市','怀远县'),('安徽省','蚌埠市','淮上区'),('安徽省','蚌埠市','禹会区'),('安徽省','蚌埠市','蚌山区'),('安徽省','蚌埠市','龙子湖区'),('安徽省','铜陵市','狮子山区'),('安徽省','铜陵市','郊区'),('安徽省','铜陵市','铜官山区'),('安徽省','铜陵市','铜陵县'),('安徽省','阜阳市','临泉县'),('安徽省','阜阳市','太和县'),('安徽省','阜阳市','界首市'),('安徽省','阜阳市','阜南县'),('安徽省','阜阳市','颍上县'),('安徽省','阜阳市','颍东区'),('安徽省','阜阳市','颍州区'),('安徽省','阜阳市','颍泉区'),('安徽省','马鞍山市','博望区'),('安徽省','马鞍山市','含山县'),('安徽省','马鞍山市','和县'),('安徽省','马鞍山市','当涂县'),('安徽省','马鞍山市','花山区'),('安徽省','马鞍山市','雨山区'),('安徽省','黄山市','休宁县'),('安徽省','黄山市','屯溪区'),('安徽省','黄山市','徽州区'),('安徽省','黄山市','歙县'),('安徽省','黄山市','祁门县'),('安徽省','黄山市','黄山区'),('安徽省','黄山市','黟县'),('山东省','东营市','东营区'),('山东省','东营市','利津县'),('山东省','东营市','垦利县'),('山东省','东营市','广饶县'),('山东省','东营市','河口区'),('山东省','临沂市','临沭县'),('山东省','临沂市','兰山区'),('山东省','临沂市','平邑县'),('山东省','临沂市','沂南县'),('山东省','临沂市','沂水县'),('山东省','临沂市','河东区'),('山东省','临沂市','罗庄区'),('山东省','临沂市','苍山县'),('山东省','临沂市','莒南县'),('山东省','临沂市','蒙阴县'),('山东省','临沂市','费县'),('山东省','临沂市','郯城县'),('山东省','威海市','乳山市'),('山东省','威海市','文登市'),('山东省','威海市','环翠区'),('山东省','威海市','荣成市'),('山东省','德州市','临邑县'),('山东省','德州市','乐陵市'),('山东省','德州市','夏津县'),('山东省','德州市','宁津县'),('山东省','德州市','平原县'),('山东省','德州市','庆云县'),('山东省','德州市','德城区'),('山东省','德州市','武城县'),('山东省','德州市','禹城市'),('山东省','德州市','陵县'),('山东省','德州市','齐河县'),('山东省','日照市','东港区'),('山东省','日照市','五莲县'),('山东省','日照市','岚山区'),('山东省','日照市','莒县'),('山东省','枣庄市','台儿庄区'),('山东省','枣庄市','山亭区'),('山东省','枣庄市','峄城区'),('山东省','枣庄市','市中区'),('山东省','枣庄市','滕州市'),('山东省','枣庄市','薛城区'),('山东省','泰安市','东平县'),('山东省','泰安市','宁阳县'),('山东省','泰安市','岱岳区'),('山东省','泰安市','新泰市'),('山东省','泰安市','泰山区'),('山东省','泰安市','肥城市'),('山东省','济南市','历下区'),('山东省','济南市','历城区'),('山东省','济南市','商河县'),('山东省','济南市','天桥区'),('山东省','济南市','市中区'),('山东省','济南市','平阴县'),('山东省','济南市','槐荫区'),('山东省','济南市','济阳县'),('山东省','济南市','章丘市'),('山东省','济南市','长清区'),('山东省','济宁市','任城区'),('山东省','济宁市','兖州市'),('山东省','济宁市','嘉祥县'),('山东省','济宁市','市中区'),('山东省','济宁市','微山县'),('山东省','济宁市','曲阜市'),('山东省','济宁市','梁山县'),('山东省','济宁市','汶上县'),('山东省','济宁市','泗水县'),('山东省','济宁市','邹城市'),('山东省','济宁市','金乡县'),('山东省','济宁市','鱼台县'),('山东省','淄博市','临淄区'),('山东省','淄博市','博山区'),('山东省','淄博市','周村区'),('山东省','淄博市','张店区'),('山东省','淄博市','桓台县'),('山东省','淄博市','沂源县'),('山东省','淄博市','淄川区'),('山东省','淄博市','高青县'),('山东省','滨州市','博兴县'),('山东省','滨州市','惠民县'),('山东省','滨州市','无棣县'),('山东省','滨州市','沾化县'),('山东省','滨州市','滨城区'),('山东省','滨州市','邹平县'),('山东省','滨州市','阳信县'),('山东省','潍坊市','临朐县'),('山东省','潍坊市','坊子区'),('山东省','潍坊市','奎文区'),('山东省','潍坊市','安丘市'),('山东省','潍坊市','寒亭区'),('山东省','潍坊市','寿光市'),('山东省','潍坊市','昌乐县'),('山东省','潍坊市','昌邑市'),('山东省','潍坊市','潍城区'),('山东省','潍坊市','诸城市'),('山东省','潍坊市','青州市'),('山东省','潍坊市','高密市'),('山东省','烟台市','招远市'),('山东省','烟台市','栖霞市'),('山东省','烟台市','海阳市'),('山东省','烟台市','牟平区'),('山东省','烟台市','福山区'),('山东省','烟台市','芝罘区'),('山东省','烟台市','莱山区'),('山东省','烟台市','莱州市'),('山东省','烟台市','莱阳市'),('山东省','烟台市','蓬莱市'),('山东省','烟台市','长岛县'),('山东省','烟台市','龙口市'),('山东省','聊城市','东昌府区'),('山东省','聊城市','东阿县'),('山东省','聊城市','临清市'),('山东省','聊城市','冠县'),('山东省','聊城市','茌平县'),('山东省','聊城市','莘县'),('山东省','聊城市','阳谷县'),('山东省','聊城市','高唐县'),('山东省','莱芜市','莱城区'),('山东省','莱芜市','钢城区'),('山东省','菏泽市','东明县'),('山东省','菏泽市','单县'),('山东省','菏泽市','定陶县'),('山东省','菏泽市','巨野县'),('山东省','菏泽市','成武县'),('山东省','菏泽市','曹县'),('山东省','菏泽市','牡丹区'),('山东省','菏泽市','郓城县'),('山东省','菏泽市','鄄城县'),('山东省','青岛市','即墨市'),('山东省','青岛市','城阳区'),('山东省','青岛市','崂山区'),('山东省','青岛市','市北区'),('山东省','青岛市','市南区'),('山东省','青岛市','平度市'),('山东省','青岛市','李沧区'),('山东省','青岛市','胶州市'),('山东省','青岛市','莱西市'),('山东省','青岛市','黄岛区'),('山西省','临汾市','乡宁县'),('山西省','临汾市','侯马市'),('山西省','临汾市','古县'),('山西省','临汾市','吉县'),('山西省','临汾市','大宁县'),('山西省','临汾市','安泽县'),('山西省','临汾市','尧都区'),('山西省','临汾市','曲沃县'),('山西省','临汾市','永和县'),('山西省','临汾市','汾西县'),('山西省','临汾市','洪洞县'),('山西省','临汾市','浮山县'),('山西省','临汾市','翼城县'),('山西省','临汾市','蒲县'),('山西省','临汾市','襄汾县'),('山西省','临汾市','隰县'),('山西省','临汾市','霍州市'),('山西省','吕梁市','中阳县'),('山西省','吕梁市','临县'),('山西省','吕梁市','交口县'),('山西省','吕梁市','交城县'),('山西省','吕梁市','兴县'),('山西省','吕梁市','孝义市'),('山西省','吕梁市','岚县'),('山西省','吕梁市','文水县'),('山西省','吕梁市','方山县'),('山西省','吕梁市','柳林县'),('山西省','吕梁市','汾阳市'),('山西省','吕梁市','石楼县'),('山西省','吕梁市','离石区'),('山西省','大同市','南郊区'),('山西省','大同市','城区'),('山西省','大同市','大同县'),('山西省','大同市','天镇县'),('山西省','大同市','左云县'),('山西省','大同市','广灵县'),('山西省','大同市','新荣区'),('山西省','大同市','浑源县'),('山西省','大同市','灵丘县'),('山西省','大同市','矿区'),('山西省','大同市','阳高县'),('山西省','太原市','万柏林区'),('山西省','太原市','古交市'),('山西省','太原市','娄烦县'),('山西省','太原市','小店区'),('山西省','太原市','尖草坪区'),('山西省','太原市','晋源区'),('山西省','太原市','杏花岭区'),('山西省','太原市','清徐县'),('山西省','太原市','迎泽区'),('山西省','太原市','阳曲县'),('山西省','忻州市','五台县'),('山西省','忻州市','五寨县'),('山西省','忻州市','代县'),('山西省','忻州市','保德县'),('山西省','忻州市','偏关县'),('山西省','忻州市','原平市'),('山西省','忻州市','宁武县'),('山西省','忻州市','定襄县'),('山西省','忻州市','岢岚县'),('山西省','忻州市','忻府区'),('山西省','忻州市','河曲县'),('山西省','忻州市','神池县'),('山西省','忻州市','繁峙县'),('山西省','忻州市','静乐县'),('山西省','晋中市','介休市'),('山西省','晋中市','和顺县'),('山西省','晋中市','太谷县'),('山西省','晋中市','寿阳县'),('山西省','晋中市','左权县'),('山西省','晋中市','平遥县'),('山西省','晋中市','昔阳县'),('山西省','晋中市','榆次区'),('山西省','晋中市','榆社县'),('山西省','晋中市','灵石县'),('山西省','晋中市','祁县'),('山西省','晋城市','城区'),('山西省','晋城市','沁水县'),('山西省','晋城市','泽州县'),('山西省','晋城市','阳城县'),('山西省','晋城市','陵川县'),('山西省','晋城市','高平市'),('山西省','朔州市','右玉县'),('山西省','朔州市','山阴县'),('山西省','朔州市','平鲁区'),('山西省','朔州市','应县'),('山西省','朔州市','怀仁县'),('山西省','朔州市','朔城区'),('山西省','运城市','万荣县'),('山西省','运城市','临猗县'),('山西省','运城市','垣曲县'),('山西省','运城市','夏县'),('山西省','运城市','平陆县'),('山西省','运城市','新绛县'),('山西省','运城市','永济市'),('山西省','运城市','河津市'),('山西省','运城市','盐湖区'),('山西省','运城市','稷山县'),('山西省','运城市','绛县'),('山西省','运城市','芮城县'),('山西省','运城市','闻喜县'),('山西省','长治市','城区'),('山西省','长治市','壶关县'),('山西省','长治市','屯留县'),('山西省','长治市','平顺县'),('山西省','长治市','武乡县'),('山西省','长治市','沁县'),('山西省','长治市','沁源县'),('山西省','长治市','潞城市'),('山西省','长治市','襄垣县'),('山西省','长治市','郊区'),('山西省','长治市','长子县'),('山西省','长治市','长治县'),('山西省','长治市','黎城县'),('山西省','阳泉市','城区'),('山西省','阳泉市','平定县'),('山西省','阳泉市','盂县'),('山西省','阳泉市','矿区'),('山西省','阳泉市','郊区'),('广东省','东莞市','东莞市'),('广东省','中山市','中山市'),('广东省','云浮市','云城区'),('广东省','云浮市','云安县'),('广东省','云浮市','新兴县'),('广东省','云浮市','罗定市'),('广东省','云浮市','郁南县'),('广东省','佛山市','三水区'),('广东省','佛山市','南海区'),('广东省','佛山市','禅城区'),('广东省','佛山市','顺德区'),('广东省','佛山市','高明区'),('广东省','广州市','从化市'),('广东省','广州市','南沙区'),('广东省','广州市','增城市'),('广东省','广州市','天河区'),('广东省','广州市','海珠区'),('广东省','广州市','番禺区'),('广东省','广州市','白云区'),('广东省','广州市','花都区'),('广东省','广州市','荔湾区'),('广东省','广州市','萝岗区'),('广东省','广州市','越秀区'),('广东省','广州市','黄埔区'),('广东省','惠州市','博罗县'),('广东省','惠州市','惠东县'),('广东省','惠州市','惠城区'),('广东省','惠州市','惠阳区'),('广东省','惠州市','龙门县'),('广东省','揭阳市','惠来县'),('广东省','揭阳市','揭东区'),('广东省','揭阳市','揭西县'),('广东省','揭阳市','普宁市'),('广东省','揭阳市','榕城区'),('广东省','梅州市','丰顺县'),('广东省','梅州市','五华县'),('广东省','梅州市','兴宁市'),('广东省','梅州市','大埔县'),('广东省','梅州市','平远县'),('广东省','梅州市','梅县'),('广东省','梅州市','梅江区'),('广东省','梅州市','蕉岭县'),('广东省','汕头市','南澳县'),('广东省','汕头市','潮南区'),('广东省','汕头市','潮阳区'),('广东省','汕头市','澄海区'),('广东省','汕头市','濠江区'),('广东省','汕头市','金平区'),('广东省','汕头市','龙湖区'),('广东省','汕尾市','城区'),('广东省','汕尾市','海丰县'),('广东省','汕尾市','陆丰市'),('广东省','汕尾市','陆河县'),('广东省','江门市','台山市'),('广东省','江门市','开平市'),('广东省','江门市','恩平市'),('广东省','江门市','新会区'),('广东省','江门市','江海区'),('广东省','江门市','蓬江区'),('广东省','江门市','鹤山市'),('广东省','河源市','东源县'),('广东省','河源市','和平县'),('广东省','河源市','源城区'),('广东省','河源市','紫金县'),('广东省','河源市','连平县'),('广东省','河源市','龙川县'),('广东省','深圳市','光明新区'),('广东省','深圳市','南山区'),('广东省','深圳市','宝安区'),('广东省','深圳市','盐田区'),('广东省','深圳市','福田区'),('广东省','深圳市','罗湖区'),('广东省','深圳市','龙岗区'),('广东省','清远市','佛冈县'),('广东省','清远市','清城区'),('广东省','清远市','清新区'),('广东省','清远市','英德市'),('广东省','清远市','连南瑶族自治县'),('广东省','清远市','连山壮族瑶族自治县'),('广东省','清远市','连州市'),('广东省','清远市','阳山县'),('广东省','湛江市','吴川市'),('广东省','湛江市','坡头区'),('广东省','湛江市','廉江市'),('广东省','湛江市','徐闻县'),('广东省','湛江市','赤坎区'),('广东省','湛江市','遂溪县'),('广东省','湛江市','雷州市'),('广东省','湛江市','霞山区'),('广东省','湛江市','麻章区'),('广东省','潮州市','湘桥区'),('广东省','潮州市','潮安区'),('广东省','潮州市','饶平县'),('广东省','珠海市','斗门区'),('广东省','珠海市','金湾区'),('广东省','珠海市','香洲区'),('广东省','肇庆市','四会市'),('广东省','肇庆市','封开县'),('广东省','肇庆市','广宁县'),('广东省','肇庆市','德庆县'),('广东省','肇庆市','怀集县'),('广东省','肇庆市','端州区'),('广东省','肇庆市','高要市'),('广东省','肇庆市','鼎湖区'),('广东省','茂名市','信宜市'),('广东省','茂名市','化州市'),('广东省','茂名市','电白县'),('广东省','茂名市','茂南区'),('广东省','茂名市','茂港区'),('广东省','茂名市','高州市'),('广东省','阳江市','江城区'),('广东省','阳江市','阳东县'),('广东省','阳江市','阳春市'),('广东省','阳江市','阳西县'),('广东省','韶关市','乐昌市'),('广东省','韶关市','乳源瑶族自治县'),('广东省','韶关市','仁化县'),('广东省','韶关市','南雄市'),('广东省','韶关市','始兴县'),('广东省','韶关市','新丰县'),('广东省','韶关市','曲江区'),('广东省','韶关市','武江区'),('广东省','韶关市','浈江区'),('广东省','韶关市','翁源县'),('广西壮族自治区','北海市','合浦县'),('广西壮族自治区','北海市','海城区'),('广西壮族自治区','北海市','铁山港区'),('广西壮族自治区','北海市','银海区'),('广西壮族自治区','南宁市','上林县'),('广西壮族自治区','南宁市','兴宁区'),('广西壮族自治区','南宁市','宾阳县'),('广西壮族自治区','南宁市','横县'),('广西壮族自治区','南宁市','武鸣县'),('广西壮族自治区','南宁市','江南区'),('广西壮族自治区','南宁市','良庆区'),('广西壮族自治区','南宁市','西乡塘区'),('广西壮族自治区','南宁市','邕宁区'),('广西壮族自治区','南宁市','隆安县'),('广西壮族自治区','南宁市','青秀区'),('广西壮族自治区','南宁市','马山县'),('广西壮族自治区','崇左市','凭祥市'),('广西壮族自治区','崇左市','大新县'),('广西壮族自治区','崇左市','天等县'),('广西壮族自治区','崇左市','宁明县'),('广西壮族自治区','崇左市','扶绥县'),('广西壮族自治区','崇左市','江洲区'),('广西壮族自治区','崇左市','龙州县'),('广西壮族自治区','来宾市','兴宾区'),('广西壮族自治区','来宾市','合山市'),('广西壮族自治区','来宾市','忻城县'),('广西壮族自治区','来宾市','武宣县'),('广西壮族自治区','来宾市','象州县'),('广西壮族自治区','来宾市','金秀瑶族自治县'),('广西壮族自治区','柳州市','三江侗族自治县'),('广西壮族自治区','柳州市','城中区'),('广西壮族自治区','柳州市','柳北区'),('广西壮族自治区','柳州市','柳南区'),('广西壮族自治区','柳州市','柳城县'),('广西壮族自治区','柳州市','柳江县'),('广西壮族自治区','柳州市','融安县'),('广西壮族自治区','柳州市','融水苗族自治县'),('广西壮族自治区','柳州市','鱼峰区'),('广西壮族自治区','柳州市','鹿寨县'),('广西壮族自治区','桂林市','七星区'),('广西壮族自治区','桂林市','临桂区'),('广西壮族自治区','桂林市','全州县'),('广西壮族自治区','桂林市','兴安县'),('广西壮族自治区','桂林市','叠彩区'),('广西壮族自治区','桂林市','平乐县'),('广西壮族自治区','桂林市','恭城瑶族自治县'),('广西壮族自治区','桂林市','永福县'),('广西壮族自治区','桂林市','灌阳县'),('广西壮族自治区','桂林市','灵川县'),('广西壮族自治区','桂林市','秀峰区'),('广西壮族自治区','桂林市','荔蒲县'),('广西壮族自治区','桂林市','象山区'),('广西壮族自治区','桂林市','资源县'),('广西壮族自治区','桂林市','阳朔县'),('广西壮族自治区','桂林市','雁山区'),('广西壮族自治区','桂林市','龙胜各族自治县'),('广西壮族自治区','梧州市','万秀区'),('广西壮族自治区','梧州市','岑溪市'),('广西壮族自治区','梧州市','苍梧县'),('广西壮族自治区','梧州市','蒙山县'),('广西壮族自治区','梧州市','藤县'),('广西壮族自治区','梧州市','长洲区'),('广西壮族自治区','梧州市','龙圩区'),('广西壮族自治区','河池市','东兰县'),('广西壮族自治区','河池市','凤山县'),('广西壮族自治区','河池市','南丹县'),('广西壮族自治区','河池市','大化瑶族自治县'),('广西壮族自治区','河池市','天峨县'),('广西壮族自治区','河池市','宜州市'),('广西壮族自治区','河池市','巴马瑶族自治县'),('广西壮族自治区','河池市','环江毛南族自治县'),('广西壮族自治区','河池市','罗城仫佬族自治县'),('广西壮族自治区','河池市','都安瑶族自治县'),('广西壮族自治区','河池市','金城江区'),('广西壮族自治区','玉林市','兴业县'),('广西壮族自治区','玉林市','北流市'),('广西壮族自治区','玉林市','博白县'),('广西壮族自治区','玉林市','容县'),('广西壮族自治区','玉林市','玉州区'),('广西壮族自治区','玉林市','陆川县'),('广西壮族自治区','百色市','乐业县'),('广西壮族自治区','百色市','凌云县'),('广西壮族自治区','百色市','右江区'),('广西壮族自治区','百色市','平果县'),('广西壮族自治区','百色市','德保县'),('广西壮族自治区','百色市','田东县'),('广西壮族自治区','百色市','田林县'),('广西壮族自治区','百色市','田阳县'),('广西壮族自治区','百色市','西林县'),('广西壮族自治区','百色市','那坡县'),('广西壮族自治区','百色市','隆林各族自治县'),('广西壮族自治区','百色市','靖西县'),('广西壮族自治区','贵港市','平南县'),('广西壮族自治区','贵港市','桂平市'),('广西壮族自治区','贵港市','港北区'),('广西壮族自治区','贵港市','港南区'),('广西壮族自治区','贵港市','覃塘区'),('广西壮族自治区','贺州市','八步区'),('广西壮族自治区','贺州市','富川瑶族自治县'),('广西壮族自治区','贺州市','平桂管理区'),('广西壮族自治区','贺州市','昭平县'),('广西壮族自治区','贺州市','钟山县'),('广西壮族自治区','钦州市','浦北县'),('广西壮族自治区','钦州市','灵山县'),('广西壮族自治区','钦州市','钦北区'),('广西壮族自治区','钦州市','钦南区'),('广西壮族自治区','钦州市','钦州港经济技术开发区'),('广西壮族自治区','防城港市','上思县'),('广西壮族自治区','防城港市','东兴市'),('广西壮族自治区','防城港市','港口区'),('广西壮族自治区','防城港市','防城区'),('新疆维吾尔自治区','乌鲁木齐市','乌鲁木齐县'),('新疆维吾尔自治区','乌鲁木齐市','天山区'),('新疆维吾尔自治区','乌鲁木齐市','头屯河区'),('新疆维吾尔自治区','乌鲁木齐市','新市区'),('新疆维吾尔自治区','乌鲁木齐市','水磨沟区'),('新疆维吾尔自治区','乌鲁木齐市','沙依巴克区'),('新疆维吾尔自治区','乌鲁木齐市','米东区'),('新疆维吾尔自治区','乌鲁木齐市','达坂城区'),('新疆维吾尔自治区','五家渠市','五家渠市'),('新疆维吾尔自治区','伊犁哈萨克自治州','伊宁县'),('新疆维吾尔自治区','伊犁哈萨克自治州','伊宁市'),('新疆维吾尔自治区','伊犁哈萨克自治州','奎屯市'),('新疆维吾尔自治区','伊犁哈萨克自治州','察布查尔锡伯自治县'),('新疆维吾尔自治区','伊犁哈萨克自治州','尼勒克县'),('新疆维吾尔自治区','伊犁哈萨克自治州','巩留县'),('新疆维吾尔自治区','伊犁哈萨克自治州','新源县'),('新疆维吾尔自治区','伊犁哈萨克自治州','昭苏县'),('新疆维吾尔自治区','伊犁哈萨克自治州','特克斯县'),('新疆维吾尔自治区','伊犁哈萨克自治州','霍城县'),('新疆维吾尔自治区','克孜勒苏柯尔克孜自治州','乌恰县'),('新疆维吾尔自治区','克孜勒苏柯尔克孜自治州','阿克陶县'),('新疆维吾尔自治区','克孜勒苏柯尔克孜自治州','阿合奇县'),('新疆维吾尔自治区','克孜勒苏柯尔克孜自治州','阿图什市'),('新疆维吾尔自治区','克拉玛依市','乌尔禾区'),('新疆维吾尔自治区','克拉玛依市','克拉玛依区'),('新疆维吾尔自治区','克拉玛依市','独山子区'),('新疆维吾尔自治区','克拉玛依市','白碱滩区'),('新疆维吾尔自治区','博尔塔拉蒙古自治州','博乐市'),('新疆维吾尔自治区','博尔塔拉蒙古自治州','温泉县'),('新疆维吾尔自治区','博尔塔拉蒙古自治州','精河县'),('新疆维吾尔自治区','吐鲁番地区','吐鲁番市'),('新疆维吾尔自治区','吐鲁番地区','托克逊县'),('新疆维吾尔自治区','吐鲁番地区','鄯善县'),('新疆维吾尔自治区','和田地区','于田县'),('新疆维吾尔自治区','和田地区','和田县'),('新疆维吾尔自治区','和田地区','和田市'),('新疆维吾尔自治区','和田地区','墨玉县'),('新疆维吾尔自治区','和田地区','民丰县'),('新疆维吾尔自治区','和田地区','洛浦县'),('新疆维吾尔自治区','和田地区','皮山县'),('新疆维吾尔自治区','和田地区','策勒县'),('新疆维吾尔自治区','哈密地区','伊吾县'),('新疆维吾尔自治区','哈密地区','哈密市'),('新疆维吾尔自治区','哈密地区','巴里坤哈萨克自治县'),('新疆维吾尔自治区','喀什地区','伽师县'),('新疆维吾尔自治区','喀什地区','叶城县'),('新疆维吾尔自治区','喀什地区','喀什市'),('新疆维吾尔自治区','喀什地区','塔什库尔干塔吉克自治县'),('新疆维吾尔自治区','喀什地区','岳普湖县'),('新疆维吾尔自治区','喀什地区','巴楚县'),('新疆维吾尔自治区','喀什地区','泽普县'),('新疆维吾尔自治区','喀什地区','疏勒县'),('新疆维吾尔自治区','喀什地区','疏附县'),('新疆维吾尔自治区','喀什地区','英吉沙县'),('新疆维吾尔自治区','喀什地区','莎车县'),('新疆维吾尔自治区','喀什地区','麦盖提县'),('新疆维吾尔自治区','图木舒克市','图木舒克市'),('新疆维吾尔自治区','塔城地区','乌苏市'),('新疆维吾尔自治区','塔城地区','和布克赛尔蒙古自治县'),('新疆维吾尔自治区','塔城地区','塔城市'),('新疆维吾尔自治区','塔城地区','托里县'),('新疆维吾尔自治区','塔城地区','沙湾县'),('新疆维吾尔自治区','塔城地区','裕民县'),('新疆维吾尔自治区','塔城地区','额敏县'),('新疆维吾尔自治区','巴音郭楞蒙古自治州','且末县'),('新疆维吾尔自治区','巴音郭楞蒙古自治州','博湖县'),('新疆维吾尔自治区','巴音郭楞蒙古自治州','和硕县'),('新疆维吾尔自治区','巴音郭楞蒙古自治州','和静县'),('新疆维吾尔自治区','巴音郭楞蒙古自治州','尉犁县'),('新疆维吾尔自治区','巴音郭楞蒙古自治州','库尔勒市'),('新疆维吾尔自治区','巴音郭楞蒙古自治州','焉耆回族自治县'),('新疆维吾尔自治区','巴音郭楞蒙古自治州','若羌县'),('新疆维吾尔自治区','巴音郭楞蒙古自治州','轮台县'),('新疆维吾尔自治区','昌吉回族自治州','吉木萨尔县'),('新疆维吾尔自治区','昌吉回族自治州','呼图壁县'),('新疆维吾尔自治区','昌吉回族自治州','奇台县'),('新疆维吾尔自治区','昌吉回族自治州','昌吉市'),('新疆维吾尔自治区','昌吉回族自治州','木垒哈萨克自治县'),('新疆维吾尔自治区','昌吉回族自治州','玛纳斯县'),('新疆维吾尔自治区','昌吉回族自治州','阜康市'),('新疆维吾尔自治区','石河子市','石河子市'),('新疆维吾尔自治区','阿克苏地区','乌什县'),('新疆维吾尔自治区','阿克苏地区','库车县'),('新疆维吾尔自治区','阿克苏地区','拜城县'),('新疆维吾尔自治区','阿克苏地区','新和县'),('新疆维吾尔自治区','阿克苏地区','柯坪县'),('新疆维吾尔自治区','阿克苏地区','沙雅县'),('新疆维吾尔自治区','阿克苏地区','温宿县'),('新疆维吾尔自治区','阿克苏地区','阿克苏市'),('新疆维吾尔自治区','阿克苏地区','阿瓦提县'),('新疆维吾尔自治区','阿勒泰地区','吉木乃县'),('新疆维吾尔自治区','阿勒泰地区','哈巴河县'),('新疆维吾尔自治区','阿勒泰地区','富蕴县'),('新疆维吾尔自治区','阿勒泰地区','布尔津县'),('新疆维吾尔自治区','阿勒泰地区','福海县'),('新疆维吾尔自治区','阿勒泰地区','阿勒泰市'),('新疆维吾尔自治区','阿勒泰地区','青河县'),('新疆维吾尔自治区','阿拉尔市','阿拉尔市'),('江苏省','南京市','六合区'),('江苏省','南京市','建邺区'),('江苏省','南京市','栖霞区'),('江苏省','南京市','江宁区'),('江苏省','南京市','浦口区'),('江苏省','南京市','溧水区'),('江苏省','南京市','玄武区'),('江苏省','南京市','秦淮区'),('江苏省','南京市','雨花台区'),('江苏省','南京市','高淳区'),('江苏省','南京市','鼓楼区'),('江苏省','南通市','启东市'),('江苏省','南通市','如东县'),('江苏省','南通市','如皋市'),('江苏省','南通市','崇川区'),('江苏省','南通市','海安县'),('江苏省','南通市','海门市'),('江苏省','南通市','港闸区'),('江苏省','南通市','通州区'),('江苏省','宿迁市','宿城区'),('江苏省','宿迁市','宿豫区'),('江苏省','宿迁市','沭阳县'),('江苏省','宿迁市','泗洪县'),('江苏省','宿迁市','泗阳县'),('江苏省','常州市','天宁区'),('江苏省','常州市','戚墅堰区'),('江苏省','常州市','新北区'),('江苏省','常州市','武进区'),('江苏省','常州市','溧阳市'),('江苏省','常州市','金坛市'),('江苏省','常州市','钟楼区'),('江苏省','徐州市','丰县'),('江苏省','徐州市','云龙区'),('江苏省','徐州市','新沂市'),('江苏省','徐州市','沛县'),('江苏省','徐州市','泉山区'),('江苏省','徐州市','睢宁县'),('江苏省','徐州市','贾汪区'),('江苏省','徐州市','邳州市'),('江苏省','徐州市','铜山区'),('江苏省','徐州市','鼓楼区'),('江苏省','扬州市','仪征市'),('江苏省','扬州市','宝应县'),('江苏省','扬州市','广陵区'),('江苏省','扬州市','江都区'),('江苏省','扬州市','邗江区'),('江苏省','扬州市','高邮市'),('江苏省','无锡市','北塘区'),('江苏省','无锡市','南长区'),('江苏省','无锡市','宜兴市'),('江苏省','无锡市','崇安区'),('江苏省','无锡市','惠山区'),('江苏省','无锡市','江阴市'),('江苏省','无锡市','滨湖区'),('江苏省','无锡市','锡山区'),('江苏省','泰州市','兴化市'),('江苏省','泰州市','姜堰区'),('江苏省','泰州市','泰兴市'),('江苏省','泰州市','海陵区'),('江苏省','泰州市','靖江市'),('江苏省','泰州市','高港区'),('江苏省','淮安市','洪泽县'),('江苏省','淮安市','涟水县'),('江苏省','淮安市','淮安区'),('江苏省','淮安市','淮阴区'),('江苏省','淮安市','清河区'),('江苏省','淮安市','清浦区'),('江苏省','淮安市','盱眙县'),('江苏省','淮安市','金湖县'),('江苏省','盐城市','东台市'),('江苏省','盐城市','亭湖区'),('江苏省','盐城市','响水县'),('江苏省','盐城市','大丰市'),('江苏省','盐城市','射阳县'),('江苏省','盐城市','建湖县'),('江苏省','盐城市','滨海县'),('江苏省','盐城市','盐都区'),('江苏省','盐城市','阜宁县'),('江苏省','苏州市','吴中区'),('江苏省','苏州市','吴江区'),('江苏省','苏州市','太仓市'),('江苏省','苏州市','姑苏区'),('江苏省','苏州市','常熟市'),('江苏省','苏州市','张家港市'),('江苏省','苏州市','昆山市'),('江苏省','苏州市','相城区'),('江苏省','苏州市','虎丘区'),('江苏省','连云港市','东海县'),('江苏省','连云港市','新浦区'),('江苏省','连云港市','海州区'),('江苏省','连云港市','灌云县'),('江苏省','连云港市','灌南县'),('江苏省','连云港市','赣榆县'),('江苏省','连云港市','连云区'),('江苏省','镇江市','丹徒区'),('江苏省','镇江市','丹阳市'),('江苏省','镇江市','京口区'),('江苏省','镇江市','句容市'),('江苏省','镇江市','扬中市'),('江苏省','镇江市','润州区'),('江西省','上饶市','万年县'),('江西省','上饶市','上饶县'),('江西省','上饶市','余干县'),('江西省','上饶市','信州区'),('江西省','上饶市','婺源县'),('江西省','上饶市','广丰县'),('江西省','上饶市','弋阳县'),('江西省','上饶市','德兴市'),('江西省','上饶市','横峰县'),('江西省','上饶市','玉山县'),('江西省','上饶市','鄱阳县'),('江西省','上饶市','铅山县'),('江西省','九江市','九江县'),('江西省','九江市','修水县'),('江西省','九江市','共青城市'),('江西省','九江市','庐山区'),('江西省','九江市','彭泽县'),('江西省','九江市','德安县'),('江西省','九江市','星子县'),('江西省','九江市','武宁县'),('江西省','九江市','永修县'),('江西省','九江市','浔阳区'),('江西省','九江市','湖口县'),('江西省','九江市','瑞昌市'),('江西省','九江市','都昌县'),('江西省','南昌市','东湖区'),('江西省','南昌市','南昌县'),('江西省','南昌市','安义县'),('江西省','南昌市','新建县'),('江西省','南昌市','湾里区'),('江西省','南昌市','西湖区'),('江西省','南昌市','进贤县'),('江西省','南昌市','青云谱区'),('江西省','南昌市','青山湖区'),('江西省','吉安市','万安县'),('江西省','吉安市','井冈山市'),('江西省','吉安市','吉安县'),('江西省','吉安市','吉州区'),('江西省','吉安市','吉水县'),('江西省','吉安市','安福县'),('江西省','吉安市','峡江县'),('江西省','吉安市','新干县'),('江西省','吉安市','永丰县'),('江西省','吉安市','永新县'),('江西省','吉安市','泰和县'),('江西省','吉安市','遂川县'),('江西省','吉安市','青原区'),('江西省','宜春市','万载县'),('江西省','宜春市','上高县'),('江西省','宜春市','丰城市'),('江西省','宜春市','奉新县'),('江西省','宜春市','宜丰县'),('江西省','宜春市','樟树市'),('江西省','宜春市','袁州区'),('江西省','宜春市','铜鼓县'),('江西省','宜春市','靖安县'),('江西省','宜春市','高安市'),('江西省','抚州市','东乡县'),('江西省','抚州市','临川区'),('江西省','抚州市','乐安县'),('江西省','抚州市','南丰县'),('江西省','抚州市','南城县'),('江西省','抚州市','宜黄县'),('江西省','抚州市','崇仁县'),('江西省','抚州市','广昌县'),('江西省','抚州市','资溪县'),('江西省','抚州市','金溪县'),('江西省','抚州市','黎川县'),('江西省','新余市','分宜县'),('江西省','新余市','渝水区'),('江西省','景德镇市','乐平市'),('江西省','景德镇市','昌江区'),('江西省','景德镇市','浮梁县'),('江西省','景德镇市','珠山区'),('江西省','萍乡市','上栗县'),('江西省','萍乡市','安源区'),('江西省','萍乡市','湘东区'),('江西省','萍乡市','芦溪县'),('江西省','萍乡市','莲花县'),('江西省','赣州市','上犹县'),('江西省','赣州市','于都县'),('江西省','赣州市','会昌县'),('江西省','赣州市','信丰县'),('江西省','赣州市','全南县'),('江西省','赣州市','兴国县'),('江西省','赣州市','南康市'),('江西省','赣州市','大余县'),('江西省','赣州市','宁都县'),('江西省','赣州市','安远县'),('江西省','赣州市','定南县'),('江西省','赣州市','寻乌县'),('江西省','赣州市','崇义县'),('江西省','赣州市','瑞金市'),('江西省','赣州市','石城县'),('江西省','赣州市','章贡区'),('江西省','赣州市','赣县'),('江西省','赣州市','龙南县'),('江西省','鹰潭市','余江县'),('江西省','鹰潭市','月湖区'),('江西省','鹰潭市','贵溪市'),('河北省','保定市','北市区'),('河北省','保定市','南市区'),('河北省','保定市','博野县'),('河北省','保定市','唐县'),('河北省','保定市','安国市'),('河北省','保定市','安新县'),('河北省','保定市','定兴县'),('河北省','保定市','定州市'),('河北省','保定市','容城县'),('河北省','保定市','徐水县'),('河北省','保定市','新市区'),('河北省','保定市','易县'),('河北省','保定市','曲阳县'),('河北省','保定市','望都县'),('河北省','保定市','涞水县'),('河北省','保定市','涞源县'),('河北省','保定市','涿州市'),('河北省','保定市','清苑县'),('河北省','保定市','满城县'),('河北省','保定市','莲池区'),('河北省','保定市','蠡县'),('河北省','保定市','阜平县'),('河北省','保定市','雄县'),('河北省','保定市','顺平县'),('河北省','保定市','高碑店市'),('河北省','保定市','高阳县'),('河北省','唐山市','丰南区'),('河北省','唐山市','丰润区'),('河北省','唐山市','乐亭县'),('河北省','唐山市','古冶区'),('河北省','唐山市','开平区'),('河北省','唐山市','曹妃甸区'),('河北省','唐山市','滦南县'),('河北省','唐山市','滦县'),('河北省','唐山市','玉田县'),('河北省','唐山市','路北区'),('河北省','唐山市','路南区'),('河北省','唐山市','迁安市'),('河北省','唐山市','迁西县'),('河北省','唐山市','遵化市'),('河北省','廊坊市','三河市'),('河北省','廊坊市','固安县'),('河北省','廊坊市','大厂回族自治县'),('河北省','廊坊市','大城县'),('河北省','廊坊市','安次区'),('河北省','廊坊市','广阳区'),('河北省','廊坊市','文安县'),('河北省','廊坊市','永清县'),('河北省','廊坊市','霸州市'),('河北省','廊坊市','香河县'),('河北省','张家口市','万全县'),('河北省','张家口市','下花园区'),('河北省','张家口市','宣化区'),('河北省','张家口市','宣化县'),('河北省','张家口市','尚义县'),('河北省','张家口市','崇礼县'),('河北省','张家口市','康保县'),('河北省','张家口市','张北县'),('河北省','张家口市','怀安县'),('河北省','张家口市','怀来县'),('河北省','张家口市','桥东区'),('河北省','张家口市','桥西区'),('河北省','张家口市','沽源县'),('河北省','张家口市','涿鹿县'),('河北省','张家口市','蔚县'),('河北省','张家口市','赤城县'),('河北省','张家口市','阳原县'),('河北省','承德市','丰宁满族自治县'),('河北省','承德市','兴隆县'),('河北省','承德市','双桥区'),('河北省','承德市','双滦区'),('河北省','承德市','围场满族蒙古族自治县'),('河北省','承德市','宽城满族自治县'),('河北省','承德市','平泉县'),('河北省','承德市','承德县'),('河北省','承德市','滦平县'),('河北省','承德市','隆化县'),('河北省','承德市','鹰手营子矿区'),('河北省','沧州市','东光县'),('河北省','沧州市','任丘市'),('河北省','沧州市','南皮县'),('河北省','沧州市','吴桥县'),('河北省','沧州市','孟村回族自治县'),('河北省','沧州市','新华区'),('河北省','沧州市','沧县'),('河北省','沧州市','河间市'),('河北省','沧州市','泊头市'),('河北省','沧州市','海兴县'),('河北省','沧州市','献县'),('河北省','沧州市','盐山县'),('河北省','沧州市','肃宁县'),('河北省','沧州市','运河区'),('河北省','沧州市','青县'),('河北省','沧州市','黄骅市'),('河北省','石家庄市','井陉县'),('河北省','石家庄市','井陉矿区'),('河北省','石家庄市','元氏县'),('河北省','石家庄市','平山县'),('河北省','石家庄市','新乐市'),('河北省','石家庄市','新华区'),('河北省','石家庄市','无极县'),('河北省','石家庄市','晋州市'),('河北省','石家庄市','栾城县'),('河北省','石家庄市','桥东区'),('河北省','石家庄市','桥西区'),('河北省','石家庄市','正定县'),('河北省','石家庄市','深泽县'),('河北省','石家庄市','灵寿县'),('河北省','石家庄市','藁城市'),('河北省','石家庄市','行唐县'),('河北省','石家庄市','裕华区'),('河北省','石家庄市','赞皇县'),('河北省','石家庄市','赵县'),('河北省','石家庄市','辛集市'),('河北省','石家庄市','长安区'),('河北省','石家庄市','高邑县'),('河北省','石家庄市','鹿泉市'),('河北省','秦皇岛市','北戴河区'),('河北省','秦皇岛市','卢龙县'),('河北省','秦皇岛市','山海关区'),('河北省','秦皇岛市','抚宁县'),('河北省','秦皇岛市','昌黎县'),('河北省','秦皇岛市','海港区'),('河北省','秦皇岛市','青龙满族自治县'),('河北省','衡水市','冀州市'),('河北省','衡水市','安平县'),('河北省','衡水市','故城县'),('河北省','衡水市','景县'),('河北省','衡水市','枣强县'),('河北省','衡水市','桃城区'),('河北省','衡水市','武强县'),('河北省','衡水市','武邑县'),('河北省','衡水市','深州市'),('河北省','衡水市','阜城县'),('河北省','衡水市','饶阳县'),('河北省','邢台市','临城县'),('河北省','邢台市','临西县'),('河北省','邢台市','任县'),('河北省','邢台市','内丘县'),('河北省','邢台市','南和县'),('河北省','邢台市','南宫市'),('河北省','邢台市','威县'),('河北省','邢台市','宁晋县'),('河北省','邢台市','巨鹿县'),('河北省','邢台市','平乡县'),('河北省','邢台市','广宗县'),('河北省','邢台市','新河县'),('河北省','邢台市','柏乡县'),('河北省','邢台市','桥东区'),('河北省','邢台市','桥西区'),('河北省','邢台市','沙河市'),('河北省','邢台市','清河县'),('河北省','邢台市','邢台县'),('河北省','邢台市','隆尧县'),('河北省','邯郸市','丛台区'),('河北省','邯郸市','临漳县'),('河北省','邯郸市','复兴区'),('河北省','邯郸市','大名县'),('河北省','邯郸市','峰峰矿区'),('河北省','邯郸市','广平县'),('河北省','邯郸市','成安县'),('河北省','邯郸市','曲周县'),('河北省','邯郸市','武安市'),('河北省','邯郸市','永年县'),('河北省','邯郸市','涉县'),('河北省','邯郸市','磁县'),('河北省','邯郸市','肥乡县'),('河北省','邯郸市','邯山区'),('河北省','邯郸市','邯郸县'),('河北省','邯郸市','邱县'),('河北省','邯郸市','馆陶县'),('河北省','邯郸市','魏县'),('河北省','邯郸市','鸡泽县'),('河南省','三门峡市','义马市'),('河南省','三门峡市','卢氏县'),('河南省','三门峡市','渑池县'),('河南省','三门峡市','湖滨区'),('河南省','三门峡市','灵宝市'),('河南省','三门峡市','陕县'),('河南省','信阳市','光山县'),('河南省','信阳市','商城县'),('河南省','信阳市','固始县'),('河南省','信阳市','平桥区'),('河南省','信阳市','息县'),('河南省','信阳市','新县'),('河南省','信阳市','浉河区'),('河南省','信阳市','淮滨县'),('河南省','信阳市','潢川县'),('河南省','信阳市','罗山县'),('河南省','南阳市','内乡县'),('河南省','南阳市','南召县'),('河南省','南阳市','卧龙区'),('河南省','南阳市','唐河县'),('河南省','南阳市','宛城区'),('河南省','南阳市','新野县'),('河南省','南阳市','方城县'),('河南省','南阳市','桐柏县'),('河南省','南阳市','淅川县'),('河南省','南阳市','社旗县'),('河南省','南阳市','西峡县'),('河南省','南阳市','邓州市'),('河南省','南阳市','镇平县'),('河南省','周口市','商水县'),('河南省','周口市','太康县'),('河南省','周口市','川汇区'),('河南省','周口市','扶沟县'),('河南省','周口市','沈丘县'),('河南省','周口市','淮阳县'),('河南省','周口市','西华县'),('河南省','周口市','郸城县'),('河南省','周口市','项城市'),('河南省','周口市','鹿邑县'),('河南省','商丘市','夏邑县'),('河南省','商丘市','宁陵县'),('河南省','商丘市','柘城县'),('河南省','商丘市','梁园区'),('河南省','商丘市','民权县'),('河南省','商丘市','永城市'),('河南省','商丘市','睢县'),('河南省','商丘市','睢阳区'),('河南省','商丘市','虞城县'),('河南省','安阳市','内黄县'),('河南省','安阳市','北关区'),('河南省','安阳市','安阳县'),('河南省','安阳市','文峰区'),('河南省','安阳市','林州市'),('河南省','安阳市','殷都区'),('河南省','安阳市','汤阴县'),('河南省','安阳市','滑县'),('河南省','安阳市','龙安区'),('河南省','平顶山市','卫东区'),('河南省','平顶山市','叶县'),('河南省','平顶山市','宝丰县'),('河南省','平顶山市','新华区'),('河南省','平顶山市','汝州市'),('河南省','平顶山市','湛河区'),('河南省','平顶山市','石龙区'),('河南省','平顶山市','舞钢市'),('河南省','平顶山市','郏县'),('河南省','平顶山市','鲁山县'),('河南省','开封市','兰考县'),('河南省','开封市','尉氏县'),('河南省','开封市','开封县'),('河南省','开封市','杞县'),('河南省','开封市','禹王台区'),('河南省','开封市','通许县'),('河南省','开封市','金明区'),('河南省','开封市','顺河回族区'),('河南省','开封市','鼓楼区'),('河南省','开封市','龙亭区'),('河南省','新乡市','凤泉区'),('河南省','新乡市','卫滨区'),('河南省','新乡市','卫辉市'),('河南省','新乡市','原阳县'),('河南省','新乡市','封丘县'),('河南省','新乡市','延津县'),('河南省','新乡市','新乡县'),('河南省','新乡市','牧野区'),('河南省','新乡市','红旗区'),('河南省','新乡市','获嘉县'),('河南省','新乡市','辉县市'),('河南省','新乡市','长垣县'),('河南省','洛阳市','伊川县'),('河南省','洛阳市','偃师市'),('河南省','洛阳市','吉利区'),('河南省','洛阳市','孟津县'),('河南省','洛阳市','宜阳县'),('河南省','洛阳市','嵩县'),('河南省','洛阳市','新安县'),('河南省','洛阳市','栾川县'),('河南省','洛阳市','汝阳县'),('河南省','洛阳市','洛宁县'),('河南省','洛阳市','洛龙区'),('河南省','洛阳市','涧西区'),('河南省','洛阳市','瀍河回族区'),('河南省','洛阳市','老城区'),('河南省','洛阳市','西工区'),('河南省','济源市','济源市'),('河南省','漯河市','临颍县'),('河南省','漯河市','召陵区'),('河南省','漯河市','源汇区'),('河南省','漯河市','舞阳县'),('河南省','漯河市','郾城区'),('河南省','濮阳市','华龙区'),('河南省','濮阳市','南乐县'),('河南省','濮阳市','台前县'),('河南省','濮阳市','清丰县'),('河南省','濮阳市','濮阳县'),('河南省','濮阳市','范县'),('河南省','焦作市','中站区'),('河南省','焦作市','修武县'),('河南省','焦作市','博爱县'),('河南省','焦作市','孟州市'),('河南省','焦作市','山阳区'),('河南省','焦作市','武陟县'),('河南省','焦作市','沁阳市'),('河南省','焦作市','温县'),('河南省','焦作市','解放区'),('河南省','焦作市','马村区'),('河南省','许昌市','禹州市'),('河南省','许昌市','襄城县'),('河南省','许昌市','许昌县'),('河南省','许昌市','鄢陵县'),('河南省','许昌市','长葛市'),('河南省','许昌市','魏都区'),('河南省','郑州市','上街区'),('河南省','郑州市','中原区'),('河南省','郑州市','中牟县'),('河南省','郑州市','二七区'),('河南省','郑州市','巩义市'),('河南省','郑州市','惠济区'),('河南省','郑州市','新密市'),('河南省','郑州市','新郑市'),('河南省','郑州市','登封市'),('河南省','郑州市','管城回族区'),('河南省','郑州市','荥阳市'),('河南省','郑州市','金水区'),('河南省','驻马店市','上蔡县'),('河南省','驻马店市','平舆县'),('河南省','驻马店市','新蔡县'),('河南省','驻马店市','正阳县'),('河南省','驻马店市','汝南县'),('河南省','驻马店市','泌阳县'),('河南省','驻马店市','确山县'),('河南省','驻马店市','西平县'),('河南省','驻马店市','遂平县'),('河南省','驻马店市','驿城区'),('河南省','鹤壁市','山城区'),('河南省','鹤壁市','浚县'),('河南省','鹤壁市','淇县'),('河南省','鹤壁市','淇滨区'),('河南省','鹤壁市','鹤山区'),('浙江省','丽水市','云和县'),('浙江省','丽水市','庆元县'),('浙江省','丽水市','景宁畲族自治县'),('浙江省','丽水市','松阳县'),('浙江省','丽水市','缙云县'),('浙江省','丽水市','莲都区'),('浙江省','丽水市','遂昌县'),('浙江省','丽水市','青田县'),('浙江省','丽水市','龙泉市'),('浙江省','台州市','三门县'),('浙江省','台州市','临海市'),('浙江省','台州市','仙居县'),('浙江省','台州市','天台县'),('浙江省','台州市','椒江区'),('浙江省','台州市','温岭市'),('浙江省','台州市','玉环县'),('浙江省','台州市','路桥区'),('浙江省','台州市','黄岩区'),('浙江省','嘉兴市','南湖区'),('浙江省','嘉兴市','嘉善县'),('浙江省','嘉兴市','平湖市'),('浙江省','嘉兴市','桐乡市'),('浙江省','嘉兴市','海宁市'),('浙江省','嘉兴市','海盐县'),('浙江省','嘉兴市','秀洲区'),('浙江省','宁波市','余姚市'),('浙江省','宁波市','北仑区'),('浙江省','宁波市','奉化市'),('浙江省','宁波市','宁海县'),('浙江省','宁波市','慈溪市'),('浙江省','宁波市','江东区'),('浙江省','宁波市','江北区'),('浙江省','宁波市','海曙区'),('浙江省','宁波市','象山县'),('浙江省','宁波市','鄞州区'),('浙江省','宁波市','镇海区'),('浙江省','杭州市','上城区'),('浙江省','杭州市','下城区'),('浙江省','杭州市','临安市'),('浙江省','杭州市','余杭区'),('浙江省','杭州市','富阳市'),('浙江省','杭州市','建德市'),('浙江省','杭州市','拱墅区'),('浙江省','杭州市','桐庐县'),('浙江省','杭州市','江干区'),('浙江省','杭州市','淳安县'),('浙江省','杭州市','滨江区'),('浙江省','杭州市','萧山区'),('浙江省','杭州市','西湖区'),('浙江省','温州市','乐清市'),('浙江省','温州市','平阳县'),('浙江省','温州市','文成县'),('浙江省','温州市','永嘉县'),('浙江省','温州市','泰顺县'),('浙江省','温州市','洞头县'),('浙江省','温州市','瑞安市'),('浙江省','温州市','瓯海区'),('浙江省','温州市','苍南县'),('浙江省','温州市','鹿城区'),('浙江省','温州市','龙湾区'),('浙江省','湖州市','南浔区'),('浙江省','湖州市','吴兴区'),('浙江省','湖州市','安吉县'),('浙江省','湖州市','德清县'),('浙江省','湖州市','长兴县'),('浙江省','绍兴市','上虞区'),('浙江省','绍兴市','嵊州市'),('浙江省','绍兴市','新昌县'),('浙江省','绍兴市','柯桥区'),('浙江省','绍兴市','诸暨市'),('浙江省','绍兴市','越城区'),('浙江省','舟山市','定海区'),('浙江省','舟山市','岱山县'),('浙江省','舟山市','嵊泗县'),('浙江省','舟山市','普陀区'),('浙江省','衢州市','常山县'),('浙江省','衢州市','开化县'),('浙江省','衢州市','柯城区'),('浙江省','衢州市','江山市'),('浙江省','衢州市','衢江区'),('浙江省','衢州市','龙游县'),('浙江省','金华市','东阳市'),('浙江省','金华市','义乌市'),('浙江省','金华市','兰溪市'),('浙江省','金华市','婺城区'),('浙江省','金华市','武义县'),('浙江省','金华市','永康市'),('浙江省','金华市','浦江县'),('浙江省','金华市','磐安县'),('浙江省','金华市','金东区'),('海南省','万宁市','万宁市'),('海南省','三亚市','三亚市'),('海南省','三沙市','三沙市'),('海南省','东方市','东方市'),('海南省','临高县','临高县'),('海南省','乐东黎族自治县','乐东县'),('海南省','五指山市','五指山市'),('海南省','保亭黎族苗族自治县','保亭县'),('海南省','儋州市','儋州市'),('海南省','定安县','定安县'),('海南省','屯昌县','屯昌县'),('海南省','文昌市','文昌市'),('海南省','昌江黎族自治县','昌江县'),('海南省','海口市','琼山区'),('海南省','海口市','秀英区'),('海南省','海口市','美兰区'),('海南省','海口市','龙华区'),('海南省','澄迈县','澄迈县'),('海南省','琼中黎族苗族自治县','琼中县'),('海南省','琼海市','琼海市'),('海南省','白沙黎族自治县','白沙县'),('海南省','陵水黎族自治县','陵水县'),('湖北省','仙桃市','仙桃市'),('湖北省','十堰市','丹江口市'),('湖北省','十堰市','张湾区'),('湖北省','十堰市','房县'),('湖北省','十堰市','竹山县'),('湖北省','十堰市','竹溪县'),('湖北省','十堰市','茅箭区'),('湖北省','十堰市','郧县'),('湖北省','十堰市','郧西县'),('湖北省','咸宁市','咸安区'),('湖北省','咸宁市','嘉鱼县'),('湖北省','咸宁市','崇阳县'),('湖北省','咸宁市','赤壁市'),('湖北省','咸宁市','通城县'),('湖北省','咸宁市','通山县'),('湖北省','天门市','天门市'),('湖北省','孝感市','云梦县'),('湖北省','孝感市','大悟县'),('湖北省','孝感市','孝南区'),('湖北省','孝感市','孝昌县'),('湖北省','孝感市','安陆市'),('湖北省','孝感市','应城市'),('湖北省','孝感市','汉川市'),('湖北省','宜昌市','五峰土家族自治县'),('湖北省','宜昌市','伍家岗区'),('湖北省','宜昌市','兴山县'),('湖北省','宜昌市','夷陵区'),('湖北省','宜昌市','宜都市'),('湖北省','宜昌市','当阳市'),('湖北省','宜昌市','枝江市'),('湖北省','宜昌市','点军区'),('湖北省','宜昌市','猇亭区'),('湖北省','宜昌市','秭归县'),('湖北省','宜昌市','西陵区'),('湖北省','宜昌市','远安县'),('湖北省','宜昌市','长阳土家族自治县'),('湖北省','恩施土家族苗族自治州','利川市'),('湖北省','恩施土家族苗族自治州','咸丰县'),('湖北省','恩施土家族苗族自治州','宣恩县'),('湖北省','恩施土家族苗族自治州','巴东县'),('湖北省','恩施土家族苗族自治州','建始县'),('湖北省','恩施土家族苗族自治州','恩施市'),('湖北省','恩施土家族苗族自治州','来凤县'),('湖北省','恩施土家族苗族自治州','鹤峰县'),('湖北省','武汉市','东西湖区'),('湖北省','武汉市','新洲区'),('湖北省','武汉市','武昌区'),('湖北省','武汉市','汉南区'),('湖北省','武汉市','汉阳区'),('湖北省','武汉市','江夏区'),('湖北省','武汉市','江岸区'),('湖北省','武汉市','江汉区'),('湖北省','武汉市','洪山区'),('湖北省','武汉市','硚口区'),('湖北省','武汉市','蔡甸区'),('湖北省','武汉市','青山区'),('湖北省','武汉市','黄陂区'),('湖北省','潜江市','潜江市'),('湖北省','神农架','神农架林区'),('湖北省','荆州市','公安县'),('湖北省','荆州市','松滋市'),('湖北省','荆州市','江陵县'),('湖北省','荆州市','沙市区'),('湖北省','荆州市','洪湖市'),('湖北省','荆州市','监利县'),('湖北省','荆州市','石首市'),('湖北省','荆州市','荆州区'),('湖北省','荆门市','东宝区'),('湖北省','荆门市','京山县'),('湖北省','荆门市','掇刀区'),('湖北省','荆门市','沙洋县'),('湖北省','荆门市','钟祥市'),('湖北省','襄阳市','保康县'),('湖北省','襄阳市','南漳县'),('湖北省','襄阳市','宜城市'),('湖北省','襄阳市','枣阳市'),('湖北省','襄阳市','樊城区'),('湖北省','襄阳市','老河口市'),('湖北省','襄阳市','襄城区'),('湖北省','襄阳市','襄州区'),('湖北省','襄阳市','谷城县'),('湖北省','鄂州市','华容区'),('湖北省','鄂州市','梁子湖区'),('湖北省','鄂州市','鄂城区'),('湖北省','随州市','广水市'),('湖北省','随州市','曾都区'),('湖北省','随州市','随县'),('湖北省','黄冈市','团风县'),('湖北省','黄冈市','武穴市'),('湖北省','黄冈市','浠水县'),('湖北省','黄冈市','红安县'),('湖北省','黄冈市','罗田县'),('湖北省','黄冈市','英山县'),('湖北省','黄冈市','蕲春县'),('湖北省','黄冈市','麻城市'),('湖北省','黄冈市','黄州区'),('湖北省','黄冈市','黄梅县'),('湖北省','黄石市','下陆区'),('湖北省','黄石市','大冶市'),('湖北省','黄石市','西塞山区'),('湖北省','黄石市','铁山区'),('湖北省','黄石市','阳新县'),('湖北省','黄石市','黄石港区'),('湖南省','娄底市','冷水江市'),('湖南省','娄底市','双峰县'),('湖南省','娄底市','娄底经济开发区'),('湖南省','娄底市','娄星区'),('湖南省','娄底市','新化县'),('湖南省','娄底市','涟源市'),('湖南省','岳阳市','临湘市'),('湖南省','岳阳市','云溪区'),('湖南省','岳阳市','华容县'),('湖南省','岳阳市','君山区'),('湖南省','岳阳市','屈原管理区'),('湖南省','岳阳市','岳阳县'),('湖南省','岳阳市','岳阳楼区'),('湖南省','岳阳市','岳阳经济技术开发区'),('湖南省','岳阳市','平江县'),('湖南省','岳阳市','汨罗市'),('湖南省','岳阳市','洞庭湖旅游度假区'),('湖南省','岳阳市','湘阴县'),('湖南省','常德市','临澧县'),('湖南省','常德市','安乡县'),('湖南省','常德市','桃源县'),('湖南省','常德市','武陵区'),('湖南省','常德市','汉寿县'),('湖南省','常德市','津市市'),('湖南省','常德市','澧县'),('湖南省','常德市','石门县'),('湖南省','常德市','西洞庭管理区'),('湖南省','常德市','西湖区'),('湖南省','常德市','鼎城区'),('湖南省','张家界市','慈利县'),('湖南省','张家界市','桑植县'),('湖南省','张家界市','武陵源区'),('湖南省','张家界市','永定区'),('湖南省','怀化市','中方县'),('湖南省','怀化市','会同县'),('湖南省','怀化市','新晃侗族自治县'),('湖南省','怀化市','沅陵县'),('湖南省','怀化市','洪江区'),('湖南省','怀化市','洪江市'),('湖南省','怀化市','溆浦县'),('湖南省','怀化市','芷江侗族自治县'),('湖南省','怀化市','辰溪县'),('湖南省','怀化市','通道侗族自治县'),('湖南省','怀化市','靖州苗族侗族自治县'),('湖南省','怀化市','鹤城区'),('湖南省','怀化市','麻阳苗族自治县'),('湖南省','株洲市','云龙示范区'),('湖南省','株洲市','天元区'),('湖南省','株洲市','攸县'),('湖南省','株洲市','株洲县'),('湖南省','株洲市','炎陵县'),('湖南省','株洲市','石峰区'),('湖南省','株洲市','芦淞区'),('湖南省','株洲市','茶陵县'),('湖南省','株洲市','荷塘区'),('湖南省','株洲市','醴陵市'),('湖南省','永州市','东安县'),('湖南省','永州市','冷水滩区'),('湖南省','永州市','双牌县'),('湖南省','永州市','回龙圩管理区'),('湖南省','永州市','宁远县'),('湖南省','永州市','新田县'),('湖南省','永州市','江华瑶族自治县'),('湖南省','永州市','江永县'),('湖南省','永州市','祁阳县'),('湖南省','永州市','蓝山县'),('湖南省','永州市','道县'),('湖南省','永州市','金洞管理区'),('湖南省','永州市','零陵区'),('湖南省','湘潭市','岳塘区'),('湖南省','湘潭市','湘乡市'),('湖南省','湘潭市','湘潭县'),('湖南省','湘潭市','雨湖区'),('湖南省','湘潭市','韶山市'),('湖南省','湘西土家族苗族自治州','保靖县'),('湖南省','湘西土家族苗族自治州','凤凰县'),('湖南省','湘西土家族苗族自治州','古丈县'),('湖南省','湘西土家族苗族自治州','吉首市'),('湖南省','湘西土家族苗族自治州','永顺县'),('湖南省','湘西土家族苗族自治州','泸溪县'),('湖南省','湘西土家族苗族自治州','花垣县'),('湖南省','湘西土家族苗族自治州','龙山县'),('湖南省','益阳市','南县'),('湖南省','益阳市','大通湖区'),('湖南省','益阳市','安化县'),('湖南省','益阳市','桃江县'),('湖南省','益阳市','沅江市'),('湖南省','益阳市','资阳区'),('湖南省','益阳市','赫山区'),('湖南省','衡阳市','南岳区'),('湖南省','衡阳市','常宁市'),('湖南省','衡阳市','珠晖区'),('湖南省','衡阳市','石鼓区'),('湖南省','衡阳市','祁东县'),('湖南省','衡阳市','耒阳市'),('湖南省','衡阳市','蒸湘区'),('湖南省','衡阳市','衡东县'),('湖南省','衡阳市','衡南县'),('湖南省','衡阳市','衡山县'),('湖南省','衡阳市','衡阳县'),('湖南省','衡阳市','雁峰区'),('湖南省','邵阳市','北塔区'),('湖南省','邵阳市','双清区'),('湖南省','邵阳市','城步苗族自治县'),('湖南省','邵阳市','大祥区'),('湖南省','邵阳市','新宁县'),('湖南省','邵阳市','新邵县'),('湖南省','邵阳市','武冈市'),('湖南省','邵阳市','洞口县'),('湖南省','邵阳市','绥宁县'),('湖南省','邵阳市','邵东县'),('湖南省','邵阳市','邵阳县'),('湖南省','邵阳市','隆回县'),('湖南省','郴州市','临武县'),('湖南省','郴州市','北湖区'),('湖南省','郴州市','嘉禾县'),('湖南省','郴州市','安仁县'),('湖南省','郴州市','宜章县'),('湖南省','郴州市','桂东县'),('湖南省','郴州市','桂阳县'),('湖南省','郴州市','永兴县'),('湖南省','郴州市','汝城县'),('湖南省','郴州市','苏仙区'),('湖南省','郴州市','资兴市'),('湖南省','长沙市','天心区'),('湖南省','长沙市','宁乡县'),('湖南省','长沙市','岳麓区'),('湖南省','长沙市','开福区'),('湖南省','长沙市','望城区'),('湖南省','长沙市','浏阳市'),('湖南省','长沙市','芙蓉区'),('湖南省','长沙市','长沙县'),('湖南省','长沙市','雨花区'),('甘肃省','临夏回族自治州','东乡族自治县'),('甘肃省','临夏回族自治州','临夏县'),('甘肃省','临夏回族自治州','临夏市'),('甘肃省','临夏回族自治州','和政县'),('甘肃省','临夏回族自治州','广河县'),('甘肃省','临夏回族自治州','康乐县'),('甘肃省','临夏回族自治州','永靖县'),('甘肃省','临夏回族自治州','积石山保安族东乡族撒拉族自治县'),('甘肃省','兰州市','七里河区'),('甘肃省','兰州市','城关区'),('甘肃省','兰州市','安宁区'),('甘肃省','兰州市','榆中县'),('甘肃省','兰州市','永登县'),('甘肃省','兰州市','皋兰县'),('甘肃省','兰州市','红古区'),('甘肃省','兰州市','西固区'),('甘肃省','嘉峪关市','嘉峪关市'),('甘肃省','天水市','张家川回族自治县'),('甘肃省','天水市','武山县'),('甘肃省','天水市','清水县'),('甘肃省','天水市','甘谷县'),('甘肃省','天水市','秦安县'),('甘肃省','天水市','秦州区'),('甘肃省','天水市','麦积区'),('甘肃省','定西市','临洮县'),('甘肃省','定西市','安定区'),('甘肃省','定西市','岷县'),('甘肃省','定西市','渭源县'),('甘肃省','定西市','漳县'),('甘肃省','定西市','通渭县'),('甘肃省','定西市','陇西县'),('甘肃省','平凉市','华亭县'),('甘肃省','平凉市','崆峒区'),('甘肃省','平凉市','崇信县'),('甘肃省','平凉市','庄浪县'),('甘肃省','平凉市','泾川县'),('甘肃省','平凉市','灵台县'),('甘肃省','平凉市','静宁县'),('甘肃省','庆阳市','华池县'),('甘肃省','庆阳市','合水县'),('甘肃省','庆阳市','宁县'),('甘肃省','庆阳市','庆城县'),('甘肃省','庆阳市','正宁县'),('甘肃省','庆阳市','环县'),('甘肃省','庆阳市','西峰区'),('甘肃省','庆阳市','镇原县'),('甘肃省','张掖市','临泽县'),('甘肃省','张掖市','山丹县'),('甘肃省','张掖市','民乐县'),('甘肃省','张掖市','甘州区'),('甘肃省','张掖市','肃南裕固族自治县'),('甘肃省','张掖市','高台县'),('甘肃省','武威市','凉州区'),('甘肃省','武威市','古浪县'),('甘肃省','武威市','天祝藏族自治县'),('甘肃省','武威市','民勤县'),('甘肃省','甘南藏族自治州','临潭县'),('甘肃省','甘南藏族自治州','卓尼县'),('甘肃省','甘南藏族自治州','合作市'),('甘肃省','甘南藏族自治州','夏河县'),('甘肃省','甘南藏族自治州','玛曲县'),('甘肃省','甘南藏族自治州','碌曲县'),('甘肃省','甘南藏族自治州','舟曲县'),('甘肃省','甘南藏族自治州','迭部县'),('甘肃省','白银市','会宁县'),('甘肃省','白银市','平川区'),('甘肃省','白银市','景泰县'),('甘肃省','白银市','白银区'),('甘肃省','白银市','靖远县'),('甘肃省','酒泉市','敦煌市'),('甘肃省','酒泉市','玉门市'),('甘肃省','酒泉市','瓜州县'),('甘肃省','酒泉市','肃北蒙古族自治县'),('甘肃省','酒泉市','肃州区'),('甘肃省','酒泉市','金塔县'),('甘肃省','酒泉市','阿克塞哈萨克族自治县'),('甘肃省','金昌市','永昌县'),('甘肃省','金昌市','金川区'),('甘肃省','陇南市','两当县'),('甘肃省','陇南市','宕昌县'),('甘肃省','陇南市','康县'),('甘肃省','陇南市','徽县'),('甘肃省','陇南市','成县'),('甘肃省','陇南市','文县'),('甘肃省','陇南市','武都区'),('甘肃省','陇南市','礼县'),('甘肃省','陇南市','西和县'),('福建省','三明市','三元区'),('福建省','三明市','大田县'),('福建省','三明市','宁化县'),('福建省','三明市','将乐县'),('福建省','三明市','尤溪县'),('福建省','三明市','建宁县'),('福建省','三明市','明溪县'),('福建省','三明市','梅列区'),('福建省','三明市','永安市'),('福建省','三明市','沙县'),('福建省','三明市','泰宁县'),('福建省','三明市','清流县'),('福建省','南平市','光泽县'),('福建省','南平市','延平区'),('福建省','南平市','建瓯市'),('福建省','南平市','建阳市'),('福建省','南平市','政和县'),('福建省','南平市','松溪县'),('福建省','南平市','武夷山市'),('福建省','南平市','浦城县'),('福建省','南平市','邵武市'),('福建省','南平市','顺昌县'),('福建省','厦门市','同安区'),('福建省','厦门市','思明区'),('福建省','厦门市','海沧区'),('福建省','厦门市','湖里区'),('福建省','厦门市','翔安区'),('福建省','厦门市','集美区'),('福建省','宁德市','古田县'),('福建省','宁德市','周宁县'),('福建省','宁德市','寿宁县'),('福建省','宁德市','屏南县'),('福建省','宁德市','柘荣县'),('福建省','宁德市','福安市'),('福建省','宁德市','福鼎市'),('福建省','宁德市','蕉城区'),('福建省','宁德市','霞浦县'),('福建省','泉州市','丰泽区'),('福建省','泉州市','南安市'),('福建省','泉州市','安溪县'),('福建省','泉州市','德化县'),('福建省','泉州市','惠安县'),('福建省','泉州市','晋江市'),('福建省','泉州市','永春县'),('福建省','泉州市','泉港区'),('福建省','泉州市','洛江区'),('福建省','泉州市','石狮市'),('福建省','泉州市','鲤城区'),('福建省','漳州市','东山县'),('福建省','漳州市','云霄县'),('福建省','漳州市','华安县'),('福建省','漳州市','南靖县'),('福建省','漳州市','平和县'),('福建省','漳州市','漳浦县'),('福建省','漳州市','芗城区'),('福建省','漳州市','诏安县'),('福建省','漳州市','长泰县'),('福建省','漳州市','龙文区'),('福建省','漳州市','龙海市'),('福建省','福州市','仓山区'),('福建省','福州市','台江区'),('福建省','福州市','平潭县'),('福建省','福州市','晋安区'),('福建省','福州市','永泰县'),('福建省','福州市','福清市'),('福建省','福州市','罗源县'),('福建省','福州市','连江县'),('福建省','福州市','长乐市'),('福建省','福州市','闽侯县'),('福建省','福州市','闽清县'),('福建省','福州市','马尾区'),('福建省','福州市','鼓楼区'),('福建省','莆田市','仙游县'),('福建省','莆田市','城厢区'),('福建省','莆田市','涵江区'),('福建省','莆田市','秀屿区'),('福建省','莆田市','荔城区'),('福建省','龙岩市','上杭县'),('福建省','龙岩市','新罗区'),('福建省','龙岩市','武平县'),('福建省','龙岩市','永定县'),('福建省','龙岩市','漳平市'),('福建省','龙岩市','连城县'),('福建省','龙岩市','长汀县'),('西藏自治区','山南地区','乃东县'),('西藏自治区','山南地区','加查县'),('西藏自治区','山南地区','扎囊县'),('西藏自治区','山南地区','措美县'),('西藏自治区','山南地区','曲松县'),('西藏自治区','山南地区','桑日县'),('西藏自治区','山南地区','洛扎县'),('西藏自治区','山南地区','浪卡子县'),('西藏自治区','山南地区','琼结县'),('西藏自治区','山南地区','贡嘎县'),('西藏自治区','山南地区','错那县'),('西藏自治区','山南地区','隆子县'),('西藏自治区','拉萨市','城关区'),('西藏自治区','拉萨市','堆龙德庆县'),('西藏自治区','拉萨市','墨竹工卡县'),('西藏自治区','拉萨市','尼木县'),('西藏自治区','拉萨市','当雄县'),('西藏自治区','拉萨市','曲水县'),('西藏自治区','拉萨市','林周县'),('西藏自治区','拉萨市','达孜县'),('西藏自治区','日喀则地区','亚东县'),('西藏自治区','日喀则地区','仁布县'),('西藏自治区','日喀则地区','仲巴县'),('西藏自治区','日喀则地区','南木林县'),('西藏自治区','日喀则地区','吉隆县'),('西藏自治区','日喀则地区','定日县'),('西藏自治区','日喀则地区','定结县'),('西藏自治区','日喀则地区','岗巴县'),('西藏自治区','日喀则地区','康马县'),('西藏自治区','日喀则地区','拉孜县'),('西藏自治区','日喀则地区','日喀则市'),('西藏自治区','日喀则地区','昂仁县'),('西藏自治区','日喀则地区','江孜县'),('西藏自治区','日喀则地区','白朗县'),('西藏自治区','日喀则地区','聂拉木县'),('西藏自治区','日喀则地区','萨嘎县'),('西藏自治区','日喀则地区','萨迦县'),('西藏自治区','日喀则地区','谢通门县'),('西藏自治区','昌都地区','丁青县'),('西藏自治区','昌都地区','八宿县'),('西藏自治区','昌都地区','察雅县'),('西藏自治区','昌都地区','左贡县'),('西藏自治区','昌都地区','昌都县'),('西藏自治区','昌都地区','江达县'),('西藏自治区','昌都地区','洛隆县'),('西藏自治区','昌都地区','类乌齐县'),('西藏自治区','昌都地区','芒康县'),('西藏自治区','昌都地区','贡觉县'),('西藏自治区','昌都地区','边坝县'),('西藏自治区','林芝地区','墨脱县'),('西藏自治区','林芝地区','察隅县'),('西藏自治区','林芝地区','工布江达县'),('西藏自治区','林芝地区','朗县'),('西藏自治区','林芝地区','林芝县'),('西藏自治区','林芝地区','波密县'),('西藏自治区','林芝地区','米林县'),('西藏自治区','那曲地区','嘉黎县'),('西藏自治区','那曲地区','安多县'),('西藏自治区','那曲地区','尼玛县'),('西藏自治区','那曲地区','巴青县'),('西藏自治区','那曲地区','比如县'),('西藏自治区','那曲地区','班戈县'),('西藏自治区','那曲地区','申扎县'),('西藏自治区','那曲地区','索县'),('西藏自治区','那曲地区','聂荣县'),('西藏自治区','那曲地区','那曲县'),('西藏自治区','阿里地区','噶尔县'),('西藏自治区','阿里地区','措勤县'),('西藏自治区','阿里地区','改则县'),('西藏自治区','阿里地区','日土县'),('西藏自治区','阿里地区','普兰县'),('西藏自治区','阿里地区','札达县'),('西藏自治区','阿里地区','革吉县'),('贵州省','六盘水市','六枝特区'),('贵州省','六盘水市','水城县'),('贵州省','六盘水市','盘县'),('贵州省','六盘水市','钟山区'),('贵州省','安顺市','关岭布依族苗族自治县'),('贵州省','安顺市','平坝县'),('贵州省','安顺市','普定县'),('贵州省','安顺市','紫云苗族布依族自治县'),('贵州省','安顺市','西秀区'),('贵州省','安顺市','镇宁布依族苗族自治县'),('贵州省','毕节市','七星关区'),('贵州省','毕节市','大方县'),('贵州省','毕节市','威宁彝族回族苗族自治县'),('贵州省','毕节市','纳雍县'),('贵州省','毕节市','织金县'),('贵州省','毕节市','赫章县'),('贵州省','毕节市','金沙县'),('贵州省','毕节市','黔西县'),('贵州省','贵阳市','乌当区'),('贵州省','贵阳市','云岩区'),('贵州省','贵阳市','修文县'),('贵州省','贵阳市','南明区'),('贵州省','贵阳市','开阳县'),('贵州省','贵阳市','息烽县'),('贵州省','贵阳市','清镇市'),('贵州省','贵阳市','白云区'),('贵州省','贵阳市','花溪区'),('贵州省','贵阳市','观山湖区'),('贵州省','遵义市','习水县'),('贵州省','遵义市','仁怀市'),('贵州省','遵义市','余庆县'),('贵州省','遵义市','凤冈县'),('贵州省','遵义市','务川仡佬族苗族自治县'),('贵州省','遵义市','桐梓县'),('贵州省','遵义市','正安县'),('贵州省','遵义市','汇川区'),('贵州省','遵义市','湄潭县'),('贵州省','遵义市','红花岗区'),('贵州省','遵义市','绥阳县'),('贵州省','遵义市','赤水市'),('贵州省','遵义市','道真仡佬族苗族自治县'),('贵州省','遵义市','遵义县'),('贵州省','铜仁市','万山区'),('贵州省','铜仁市','印江土家族苗族自治县'),('贵州省','铜仁市','德江县'),('贵州省','铜仁市','思南县'),('贵州省','铜仁市','松桃苗族自治县'),('贵州省','铜仁市','江口县'),('贵州省','铜仁市','沿河土家族自治县'),('贵州省','铜仁市','玉屏侗族自治县'),('贵州省','铜仁市','石阡县'),('贵州省','铜仁市','碧江区'),('贵州省','黔东南苗族侗族自治州','三穗县'),('贵州省','黔东南苗族侗族自治州','丹寨县'),('贵州省','黔东南苗族侗族自治州','从江县'),('贵州省','黔东南苗族侗族自治州','凯里市'),('贵州省','黔东南苗族侗族自治州','剑河县'),('贵州省','黔东南苗族侗族自治州','台江县'),('贵州省','黔东南苗族侗族自治州','天柱县'),('贵州省','黔东南苗族侗族自治州','岑巩县'),('贵州省','黔东南苗族侗族自治州','施秉县'),('贵州省','黔东南苗族侗族自治州','榕江县'),('贵州省','黔东南苗族侗族自治州','锦屏县'),('贵州省','黔东南苗族侗族自治州','镇远县'),('贵州省','黔东南苗族侗族自治州','雷山县'),('贵州省','黔东南苗族侗族自治州','麻江县'),('贵州省','黔东南苗族侗族自治州','黄平县'),('贵州省','黔东南苗族侗族自治州','黎平县'),('贵州省','黔南布依族苗族自治州','三都水族自治县'),('贵州省','黔南布依族苗族自治州','平塘县'),('贵州省','黔南布依族苗族自治州','惠水县'),('贵州省','黔南布依族苗族自治州','独山县'),('贵州省','黔南布依族苗族自治州','瓮安县'),('贵州省','黔南布依族苗族自治州','福泉市'),('贵州省','黔南布依族苗族自治州','罗甸县'),('贵州省','黔南布依族苗族自治州','荔波县'),('贵州省','黔南布依族苗族自治州','贵定县'),('贵州省','黔南布依族苗族自治州','都匀市'),('贵州省','黔南布依族苗族自治州','长顺县'),('贵州省','黔南布依族苗族自治州','龙里县'),('贵州省','黔西南布依族苗族自治州','兴义市'),('贵州省','黔西南布依族苗族自治州','兴仁县'),('贵州省','黔西南布依族苗族自治州','册亨县'),('贵州省','黔西南布依族苗族自治州','安龙县'),('贵州省','黔西南布依族苗族自治州','普安县'),('贵州省','黔西南布依族苗族自治州','晴隆县'),('贵州省','黔西南布依族苗族自治州','望谟县'),('贵州省','黔西南布依族苗族自治州','贞丰县'),('辽宁省','丹东市','东港市'),('辽宁省','丹东市','元宝区'),('辽宁省','丹东市','凤城市'),('辽宁省','丹东市','宽甸满族自治县'),('辽宁省','丹东市','振兴区'),('辽宁省','丹东市','振安区'),('辽宁省','大连市','中山区'),('辽宁省','大连市','庄河市'),('辽宁省','大连市','旅顺口区'),('辽宁省','大连市','普兰店市'),('辽宁省','大连市','沙河口区'),('辽宁省','大连市','瓦房店市'),('辽宁省','大连市','甘井子区'),('辽宁省','大连市','西岗区'),('辽宁省','大连市','金州区'),('辽宁省','大连市','长海县'),('辽宁省','抚顺市','东洲区'),('辽宁省','抚顺市','抚顺县'),('辽宁省','抚顺市','新宾满族自治县'),('辽宁省','抚顺市','新抚区'),('辽宁省','抚顺市','望花区'),('辽宁省','抚顺市','清原满族自治县'),('辽宁省','抚顺市','顺城区'),('辽宁省','朝阳市','凌源市'),('辽宁省','朝阳市','北票市'),('辽宁省','朝阳市','双塔区'),('辽宁省','朝阳市','喀喇沁左翼蒙古族自治县'),('辽宁省','朝阳市','建平县'),('辽宁省','朝阳市','朝阳县'),('辽宁省','朝阳市','龙城区'),('辽宁省','本溪市','南芬区'),('辽宁省','本溪市','平山区'),('辽宁省','本溪市','明山区'),('辽宁省','本溪市','本溪满族自治县'),('辽宁省','本溪市','桓仁满族自治县'),('辽宁省','本溪市','溪湖区'),('辽宁省','沈阳市','于洪区'),('辽宁省','沈阳市','和平区'),('辽宁省','沈阳市','大东区'),('辽宁省','沈阳市','康平县'),('辽宁省','沈阳市','新民市'),('辽宁省','沈阳市','沈北新区'),('辽宁省','沈阳市','沈河区'),('辽宁省','沈阳市','法库县'),('辽宁省','沈阳市','浑南区（原东陵区）'),('辽宁省','沈阳市','皇姑区'),('辽宁省','沈阳市','苏家屯区'),('辽宁省','沈阳市','辽中县'),('辽宁省','沈阳市','铁西区'),('辽宁省','盘锦市','兴隆台区'),('辽宁省','盘锦市','双台子区'),('辽宁省','盘锦市','大洼县'),('辽宁省','盘锦市','盘山县'),('辽宁省','营口市','大石桥市'),('辽宁省','营口市','盖州市'),('辽宁省','营口市','站前区'),('辽宁省','营口市','老边区'),('辽宁省','营口市','西市区'),('辽宁省','营口市','鲅鱼圈区'),('辽宁省','葫芦岛市','兴城市'),('辽宁省','葫芦岛市','南票区'),('辽宁省','葫芦岛市','建昌县'),('辽宁省','葫芦岛市','绥中县'),('辽宁省','葫芦岛市','连山区'),('辽宁省','葫芦岛市','龙港区'),('辽宁省','辽阳市','太子河区'),('辽宁省','辽阳市','宏伟区'),('辽宁省','辽阳市','弓长岭区'),('辽宁省','辽阳市','文圣区'),('辽宁省','辽阳市','灯塔市'),('辽宁省','辽阳市','白塔区'),('辽宁省','辽阳市','辽阳县'),('辽宁省','铁岭市','开原市'),('辽宁省','铁岭市','昌图县'),('辽宁省','铁岭市','清河区'),('辽宁省','铁岭市','西丰县'),('辽宁省','铁岭市','调兵山市'),('辽宁省','铁岭市','铁岭县'),('辽宁省','铁岭市','银州区'),('辽宁省','锦州市','义县'),('辽宁省','锦州市','凌河区'),('辽宁省','锦州市','凌海市'),('辽宁省','锦州市','北镇市'),('辽宁省','锦州市','古塔区'),('辽宁省','锦州市','太和区'),('辽宁省','锦州市','黑山县'),('辽宁省','阜新市','太平区'),('辽宁省','阜新市','彰武县'),('辽宁省','阜新市','新邱区'),('辽宁省','阜新市','海州区'),('辽宁省','阜新市','清河门区'),('辽宁省','阜新市','细河区'),('辽宁省','阜新市','阜新蒙古族自治县'),('辽宁省','鞍山市','千山区'),('辽宁省','鞍山市','台安县'),('辽宁省','鞍山市','岫岩满族自治县'),('辽宁省','鞍山市','海城市'),('辽宁省','鞍山市','立山区'),('辽宁省','鞍山市','铁东区'),('辽宁省','鞍山市','铁西区'),('重庆','重庆市','万州区'),('重庆','重庆市','丰都县'),('重庆','重庆市','九龙坡区'),('重庆','重庆市','云阳县'),('重庆','重庆市','北碚区'),('重庆','重庆市','南岸区'),('重庆','重庆市','南川区'),('重庆','重庆市','合川区'),('重庆','重庆市','垫江县'),('重庆','重庆市','城口县'),('重庆','重庆市','大渡口区'),('重庆','重庆市','大足区'),('重庆','重庆市','奉节县'),('重庆','重庆市','巫山县'),('重庆','重庆市','巫溪县'),('重庆','重庆市','巴南区'),('重庆','重庆市','开县'),('重庆','重庆市','彭水苗族土家族自治县'),('重庆','重庆市','忠县'),('重庆','重庆市','梁平县'),('重庆','重庆市','武隆县'),('重庆','重庆市','永川区'),('重庆','重庆市','江北区'),('重庆','重庆市','江津区'),('重庆','重庆市','沙坪坝区'),('重庆','重庆市','涪陵区'),('重庆','重庆市','渝中区'),('重庆','重庆市','渝北区'),('重庆','重庆市','潼南县'),('重庆','重庆市','璧山县'),('重庆','重庆市','石柱土家族自治县'),('重庆','重庆市','秀山土家族苗族自治县'),('重庆','重庆市','綦江区'),('重庆','重庆市','荣昌县'),('重庆','重庆市','酉阳土家族苗族自治县'),('重庆','重庆市','铜梁县'),('重庆','重庆市','长寿区'),('重庆','重庆市','黔江区'),('陕西省','咸阳市','三原县'),('陕西省','咸阳市','乾县'),('陕西省','咸阳市','兴平市'),('陕西省','咸阳市','彬县'),('陕西省','咸阳市','旬邑县'),('陕西省','咸阳市','杨陵区'),('陕西省','咸阳市','武功县'),('陕西省','咸阳市','永寿县'),('陕西省','咸阳市','泾阳县'),('陕西省','咸阳市','淳化县'),('陕西省','咸阳市','渭城区'),('陕西省','咸阳市','礼泉县'),('陕西省','咸阳市','秦都区'),('陕西省','咸阳市','长武县'),('陕西省','商洛市','丹凤县'),('陕西省','商洛市','商南县'),('陕西省','商洛市','商州区'),('陕西省','商洛市','山阳县'),('陕西省','商洛市','柞水县'),('陕西省','商洛市','洛南县'),('陕西省','商洛市','镇安县'),('陕西省','安康市','宁陕县'),('陕西省','安康市','岚皋县'),('陕西省','安康市','平利县'),('陕西省','安康市','旬阳县'),('陕西省','安康市','汉滨区'),('陕西省','安康市','汉阴县'),('陕西省','安康市','白河县'),('陕西省','安康市','石泉县'),('陕西省','安康市','紫阳县'),('陕西省','安康市','镇坪县'),('陕西省','宝鸡市','凤县'),('陕西省','宝鸡市','凤翔县'),('陕西省','宝鸡市','千阳县'),('陕西省','宝鸡市','太白县'),('陕西省','宝鸡市','岐山县'),('陕西省','宝鸡市','扶风县'),('陕西省','宝鸡市','渭滨区'),('陕西省','宝鸡市','眉县'),('陕西省','宝鸡市','金台区'),('陕西省','宝鸡市','陇县'),('陕西省','宝鸡市','陈仓区'),('陕西省','宝鸡市','麟游县'),('陕西省','延安市','吴起县'),('陕西省','延安市','子长县'),('陕西省','延安市','安塞县'),('陕西省','延安市','宜川县'),('陕西省','延安市','宝塔区'),('陕西省','延安市','富县'),('陕西省','延安市','延川县'),('陕西省','延安市','延长县'),('陕西省','延安市','志丹县'),('陕西省','延安市','洛川县'),('陕西省','延安市','甘泉县'),('陕西省','延安市','黄陵县'),('陕西省','延安市','黄龙县'),('陕西省','榆林市','佳县'),('陕西省','榆林市','吴堡县'),('陕西省','榆林市','子洲县'),('陕西省','榆林市','定边县'),('陕西省','榆林市','府谷县'),('陕西省','榆林市','榆阳区'),('陕西省','榆林市','横山县'),('陕西省','榆林市','清涧县'),('陕西省','榆林市','神木县'),('陕西省','榆林市','米脂县'),('陕西省','榆林市','绥德县'),('陕西省','榆林市','靖边县'),('陕西省','汉中市','佛坪县'),('陕西省','汉中市','勉县'),('陕西省','汉中市','南郑县'),('陕西省','汉中市','城固县'),('陕西省','汉中市','宁强县'),('陕西省','汉中市','汉台区'),('陕西省','汉中市','洋县'),('陕西省','汉中市','留坝县'),('陕西省','汉中市','略阳县'),('陕西省','汉中市','西乡县'),('陕西省','汉中市','镇巴县'),('陕西省','渭南市','临渭区'),('陕西省','渭南市','华县'),('陕西省','渭南市','华阴市'),('陕西省','渭南市','合阳县'),('陕西省','渭南市','大荔县'),('陕西省','渭南市','富平县'),('陕西省','渭南市','潼关县'),('陕西省','渭南市','澄城县'),('陕西省','渭南市','白水县'),('陕西省','渭南市','蒲城县'),('陕西省','渭南市','韩城市'),('陕西省','西安市','临潼区'),('陕西省','西安市','周至县'),('陕西省','西安市','户县'),('陕西省','西安市','新城区'),('陕西省','西安市','未央区'),('陕西省','西安市','灞桥区'),('陕西省','西安市','碑林区'),('陕西省','西安市','莲湖区'),('陕西省','西安市','蓝田县'),('陕西省','西安市','长安区'),('陕西省','西安市','阎良区'),('陕西省','西安市','雁塔区'),('陕西省','西安市','高陵县'),('陕西省','铜川市','印台区'),('陕西省','铜川市','宜君县'),('陕西省','铜川市','王益区'),('陕西省','铜川市','耀州区'),('青海省','果洛藏族自治州','久治县'),('青海省','果洛藏族自治州','玛多县'),('青海省','果洛藏族自治州','玛沁县'),('青海省','果洛藏族自治州','班玛县'),('青海省','果洛藏族自治州','甘德县'),('青海省','果洛藏族自治州','达日县'),('青海省','海东市','乐都县'),('青海省','海东市','互助土族自治县'),('青海省','海东市','化隆回族自治县'),('青海省','海东市','平安县'),('青海省','海东市','循化撒拉族自治县'),('青海省','海东市','民和回族土族自治县'),('青海省','海北藏族自治州','刚察县'),('青海省','海北藏族自治州','海晏县'),('青海省','海北藏族自治州','祁连县'),('青海省','海北藏族自治州','门源回族自治县'),('青海省','海南藏族自治州','共和县'),('青海省','海南藏族自治州','兴海县'),('青海省','海南藏族自治州','同德县'),('青海省','海南藏族自治州','贵南县'),('青海省','海南藏族自治州','贵德县'),('青海省','海西蒙古族藏族自治州','乌兰县'),('青海省','海西蒙古族藏族自治州','天峻县'),('青海省','海西蒙古族藏族自治州','德令哈市'),('青海省','海西蒙古族藏族自治州','格尔木市'),('青海省','海西蒙古族藏族自治州','都兰县'),('青海省','玉树藏族自治州','囊谦县'),('青海省','玉树藏族自治州','曲麻莱县'),('青海省','玉树藏族自治州','杂多县'),('青海省','玉树藏族自治州','治多县'),('青海省','玉树藏族自治州','玉树市'),('青海省','玉树藏族自治州','称多县'),('青海省','西宁市','城东区'),('青海省','西宁市','城中区'),('青海省','西宁市','城北区'),('青海省','西宁市','城西区'),('青海省','西宁市','大通回族土族自治县'),('青海省','西宁市','湟中县'),('青海省','西宁市','湟源县'),('青海省','黄南藏族自治州','同仁县'),('青海省','黄南藏族自治州','尖扎县'),('青海省','黄南藏族自治州','河南蒙古族自治县'),('青海省','黄南藏族自治州','泽库县'),('黑龙江省','七台河市','勃利县'),('黑龙江省','七台河市','新兴区'),('黑龙江省','七台河市','桃山区'),('黑龙江省','七台河市','茄子河区'),('黑龙江省','伊春市','上甘岭区'),('黑龙江省','伊春市','乌伊岭区'),('黑龙江省','伊春市','乌马河区'),('黑龙江省','伊春市','五营区'),('黑龙江省','伊春市','伊春区'),('黑龙江省','伊春市','南岔区'),('黑龙江省','伊春市','友好区'),('黑龙江省','伊春市','嘉荫县'),('黑龙江省','伊春市','带岭区'),('黑龙江省','伊春市','新青区'),('黑龙江省','伊春市','汤旺河区'),('黑龙江省','伊春市','红星区'),('黑龙江省','伊春市','美溪区'),('黑龙江省','伊春市','翠峦区'),('黑龙江省','伊春市','西林区'),('黑龙江省','伊春市','金山屯区'),('黑龙江省','伊春市','铁力市'),('黑龙江省','佳木斯市','东风区'),('黑龙江省','佳木斯市','前进区'),('黑龙江省','佳木斯市','同江市'),('黑龙江省','佳木斯市','向阳区'),('黑龙江省','佳木斯市','富锦市'),('黑龙江省','佳木斯市','抚远县'),('黑龙江省','佳木斯市','桦南县'),('黑龙江省','佳木斯市','桦川县'),('黑龙江省','佳木斯市','汤原县'),('黑龙江省','佳木斯市','郊区'),('黑龙江省','双鸭山市','友谊县'),('黑龙江省','双鸭山市','四方台区'),('黑龙江省','双鸭山市','宝山区'),('黑龙江省','双鸭山市','宝清县'),('黑龙江省','双鸭山市','尖山区'),('黑龙江省','双鸭山市','岭东区'),('黑龙江省','双鸭山市','集贤县'),('黑龙江省','双鸭山市','饶河县'),('黑龙江省','哈尔滨市','五常市'),('黑龙江省','哈尔滨市','依兰县'),('黑龙江省','哈尔滨市','南岗区'),('黑龙江省','哈尔滨市','双城市'),('黑龙江省','哈尔滨市','呼兰区'),('黑龙江省','哈尔滨市','宾县'),('黑龙江省','哈尔滨市','尚志市'),('黑龙江省','哈尔滨市','巴彦县'),('黑龙江省','哈尔滨市','平房区'),('黑龙江省','哈尔滨市','延寿县'),('黑龙江省','哈尔滨市','方正县'),('黑龙江省','哈尔滨市','木兰县'),('黑龙江省','哈尔滨市','松北区'),('黑龙江省','哈尔滨市','通河县'),('黑龙江省','哈尔滨市','道外区'),('黑龙江省','哈尔滨市','道里区'),('黑龙江省','哈尔滨市','阿城区'),('黑龙江省','哈尔滨市','香坊区'),('黑龙江省','大兴安岭地区','加格达奇区'),('黑龙江省','大兴安岭地区','呼中区'),('黑龙江省','大兴安岭地区','呼玛县'),('黑龙江省','大兴安岭地区','塔河县'),('黑龙江省','大兴安岭地区','新林区'),('黑龙江省','大兴安岭地区','松岭区'),('黑龙江省','大兴安岭地区','漠河县'),('黑龙江省','大庆市','大同区'),('黑龙江省','大庆市','杜尔伯特蒙古族自治县'),('黑龙江省','大庆市','林甸县'),('黑龙江省','大庆市','红岗区'),('黑龙江省','大庆市','肇州县'),('黑龙江省','大庆市','肇源县'),('黑龙江省','大庆市','萨尔图区'),('黑龙江省','大庆市','让胡路区'),('黑龙江省','大庆市','龙凤区'),('黑龙江省','牡丹江市','东宁县'),('黑龙江省','牡丹江市','东安区'),('黑龙江省','牡丹江市','宁安市'),('黑龙江省','牡丹江市','林口县'),('黑龙江省','牡丹江市','海林市'),('黑龙江省','牡丹江市','爱民区'),('黑龙江省','牡丹江市','穆棱市'),('黑龙江省','牡丹江市','绥芬河市'),('黑龙江省','牡丹江市','西安区'),('黑龙江省','牡丹江市','阳明区'),('黑龙江省','绥化市','兰西县'),('黑龙江省','绥化市','北林区'),('黑龙江省','绥化市','安达市'),('黑龙江省','绥化市','庆安县'),('黑龙江省','绥化市','明水县'),('黑龙江省','绥化市','望奎县'),('黑龙江省','绥化市','海伦市'),('黑龙江省','绥化市','绥棱县'),('黑龙江省','绥化市','肇东市'),('黑龙江省','绥化市','青冈县'),('黑龙江省','鸡西市','城子河区'),('黑龙江省','鸡西市','密山市'),('黑龙江省','鸡西市','恒山区'),('黑龙江省','鸡西市','梨树区'),('黑龙江省','鸡西市','滴道区'),('黑龙江省','鸡西市','虎林市'),('黑龙江省','鸡西市','鸡东县'),('黑龙江省','鸡西市','鸡冠区'),('黑龙江省','鸡西市','麻山区'),('黑龙江省','鹤岗市','东山区'),('黑龙江省','鹤岗市','兴安区'),('黑龙江省','鹤岗市','兴山区'),('黑龙江省','鹤岗市','南山区'),('黑龙江省','鹤岗市','向阳区'),('黑龙江省','鹤岗市','工农区'),('黑龙江省','鹤岗市','绥滨县'),('黑龙江省','鹤岗市','萝北县'),('黑龙江省','黑河市','五大连池市'),('黑龙江省','黑河市','北安市'),('黑龙江省','黑河市','嫩江县'),('黑龙江省','黑河市','孙吴县'),('黑龙江省','黑河市','爱辉区'),('黑龙江省','黑河市','逊克县'),('黑龙江省','齐齐哈尔市','依安县'),('黑龙江省','齐齐哈尔市','克东县'),('黑龙江省','齐齐哈尔市','克山县'),('黑龙江省','齐齐哈尔市','富拉尔基区'),('黑龙江省','齐齐哈尔市','富裕县'),('黑龙江省','齐齐哈尔市','建华区'),('黑龙江省','齐齐哈尔市','拜泉县'),('黑龙江省','齐齐哈尔市','昂昂溪区'),('黑龙江省','齐齐哈尔市','梅里斯达斡尔族区'),('黑龙江省','齐齐哈尔市','泰来县'),('黑龙江省','齐齐哈尔市','甘南县'),('黑龙江省','齐齐哈尔市','碾子山区'),('黑龙江省','齐齐哈尔市','讷河市'),('黑龙江省','齐齐哈尔市','铁锋区'),('黑龙江省','齐齐哈尔市','龙江县'),('黑龙江省','齐齐哈尔市','龙沙区');

/*Table structure for table `dmcs_message_mq` */

DROP TABLE IF EXISTS `dmcs_message_mq`;

CREATE TABLE `dmcs_message_mq` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `order_id` int(10) unsigned NOT NULL,
  `order_sn` varchar(255) NOT NULL,
  `order_item_count` int(10) unsigned NOT NULL,
  `type` varchar(20) NOT NULL,
  `message` text NOT NULL,
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP,
  `finished_at` datetime DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

/*Data for the table `dmcs_message_mq` */

/*Table structure for table `employee` */

DROP TABLE IF EXISTS `employee`;

CREATE TABLE `employee` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '自增id',
  `openid` varchar(200) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '微信openid',
  `wechat_id` int(11) DEFAULT NULL COMMENT 'wechat_id',
  `empid` varchar(200) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '导购编号',
  `store_code` varchar(200) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '导购门店id',
  `spuid` varchar(100) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '产品 唯一吗',
  `skuid` varchar(100) COLLATE utf8mb4_bin DEFAULT NULL COMMENT 'sku 唯一吗',
  `ordered_flag` tinyint(4) DEFAULT '0' COMMENT '0 未下单  1  已下单  2  失效',
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  `order_goods_id` varchar(100) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '订单行编号',
  `created_at` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '创建时间',
  UNIQUE KEY `id` (`id`) USING BTREE,
  KEY `openid_idx` (`openid`(191)) USING BTREE,
  KEY `empid_idx` (`empid`(191)) USING BTREE,
  KEY `spuid_idx` (`spuid`) USING BTREE,
  KEY `skuid_idx` (`skuid`) USING BTREE,
  KEY `flag_idx` (`ordered_flag`) USING BTREE,
  KEY `wechat_id_idx` (`wechat_id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin ROW_FORMAT=DYNAMIC;

/*Data for the table `employee` */

/*Table structure for table `failed_jobs` */

DROP TABLE IF EXISTS `failed_jobs`;

CREATE TABLE `failed_jobs` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `connection` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `queue` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `exception` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci ROW_FORMAT=DYNAMIC;

/*Data for the table `failed_jobs` */

/*Table structure for table `items` */

DROP TABLE IF EXISTS `items`;

CREATE TABLE `items` (
  `item_id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `order_id` int(10) unsigned NOT NULL COMMENT '订单id',
  `product_id` int(10) unsigned DEFAULT NULL COMMENT '商品id',
  `product_type` varchar(255) DEFAULT NULL COMMENT '商品类型',
  `product_options` varchar(255) DEFAULT NULL COMMENT '商品option',
  `sku` varchar(255) DEFAULT NULL COMMENT 'SKU',
  `image` varchar(255) DEFAULT NULL COMMENT '图片',
  `name` varchar(255) DEFAULT NULL COMMENT '商品名称',
  `weight` int(10) unsigned DEFAULT NULL COMMENT '商品重量',
  `original_price` decimal(10,2) DEFAULT NULL COMMENT '原始价格',
  `price` decimal(10,2) DEFAULT NULL COMMENT '价格',
  `qty` int(10) unsigned DEFAULT NULL COMMENT '数量',
  `row_total` decimal(12,2) unsigned DEFAULT NULL COMMENT '小计',
  `discount_amount` varchar(255) DEFAULT NULL COMMENT '折扣',
  `applied_rule_ids` text COMMENT '规则id',
  `qty_refunded` int(10) unsigned DEFAULT NULL COMMENT '退货数量',
  `qty_shipped` int(10) unsigned DEFAULT NULL COMMENT '发货数量',
  `content` varchar(255) DEFAULT NULL COMMENT '刻字',
  `status` varchar(255) DEFAULT NULL COMMENT '订单内商品状态   ',
  PRIMARY KEY (`item_id`) USING BTREE,
  KEY `order_id` (`order_id`) USING BTREE,
  CONSTRAINT `items_ibfk_1` FOREIGN KEY (`order_id`) REFERENCES `orders` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 ROW_FORMAT=DYNAMIC;

/*Data for the table `items` */

/*Table structure for table `oms_after_sale_item` */

DROP TABLE IF EXISTS `oms_after_sale_item`;

CREATE TABLE `oms_after_sale_item` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `after_sale_id` int(11) DEFAULT NULL COMMENT '售后主表id',
  `item_order_id` varchar(50) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '子订单id',
  `sku_id` varchar(50) COLLATE utf8mb4_bin DEFAULT '' COMMENT 'sku 供应商sku',
  `product_name` varchar(200) COLLATE utf8mb4_bin DEFAULT '' COMMENT '商品名称',
  `image` varchar(255) COLLATE utf8mb4_bin DEFAULT '' COMMENT '商品图片',
  `num` int(10) DEFAULT '1' COMMENT '商品数量',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin COMMENT='售后详情商品';

/*Data for the table `oms_after_sale_item` */

/*Table structure for table `oms_after_sales` */

DROP TABLE IF EXISTS `oms_after_sales`;

CREATE TABLE `oms_after_sales` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `after_sale_no` varchar(30) COLLATE utf8mb4_bin NOT NULL,
  `pos_id` varchar(30) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '用户id',
  `order_main_id` varchar(20) COLLATE utf8mb4_bin NOT NULL DEFAULT '',
  `remark` text COLLATE utf8mb4_bin COMMENT '处理记录',
  `account_name` varchar(50) COLLATE utf8mb4_bin DEFAULT '' COMMENT '支付宝账号',
  `question_desc` varchar(255) COLLATE utf8mb4_bin DEFAULT '' COMMENT '描述',
  `status` tinyint(2) DEFAULT '0' COMMENT '售后状态 0售后中 1已完成 2拒绝',
  `payment_type` tinyint(1) DEFAULT '0' COMMENT '  1AliPay,2 WeixinPay,3 UnionPay 4HuabeiPay 5 Offline 6 miniapp',
  `return_amount` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '退款金额',
  `pay_amount` decimal(10,2) DEFAULT '0.00' COMMENT '订单支付金额',
  `total_pay_amount` decimal(10,2) DEFAULT '0.00' COMMENT '订单支付总金额',
  `original_price` decimal(10,2) DEFAULT '0.00' COMMENT '商品原价总金额',
  `bank_no` varchar(50) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '卡号',
  `name` varchar(50) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '持卡人',
  `bank_name` varchar(50) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '银行卡',
  `return_pay_type` tinyint(1) DEFAULT NULL COMMENT '1原路退回 2银行卡 3支付宝 4无需退',
  `return_type` tinyint(2) DEFAULT '0' COMMENT '退货类型 1全部退 2部分退',
  `express_type` int(11) DEFAULT NULL COMMENT '快递类型',
  `express_no` varchar(50) COLLATE utf8mb4_bin DEFAULT NULL,
  `district` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '区/县',
  `province` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '省份',
  `city` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '城市',
  `address` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '详细地址',
  `zip_code` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '邮政编码',
  `contact` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '联系人',
  `delivery_mode` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '运输方式',
  `store_code` int(6) DEFAULT NULL COMMENT '门店ID',
  `return_pay_at` timestamp NULL DEFAULT NULL COMMENT '退款时间',
  `return_at` timestamp NULL DEFAULT NULL COMMENT '货物退回时间',
  `updated_at` timestamp NULL DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP,
  `created_at` timestamp NULL DEFAULT NULL,
  `trade_type` tinyint(2) DEFAULT '0' COMMENT '支付类型',
  PRIMARY KEY (`id`),
  KEY `pos_id` (`pos_id`),
  KEY `after_sale_no` (`after_sale_no`),
  KEY `order_main_id` (`order_main_id`),
  KEY `status` (`status`),
  KEY `payment_type` (`payment_type`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin COMMENT='售后';

/*Data for the table `oms_after_sales` */

/*Table structure for table `oms_daily_items_summary` */

DROP TABLE IF EXISTS `oms_daily_items_summary`;

CREATE TABLE `oms_daily_items_summary` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `product_id` varchar(100) NOT NULL,
  `product_name` varchar(100) NOT NULL,
  `kv_image` text,
  `qty` int(10) NOT NULL,
  `amount` decimal(30,4) NOT NULL,
  `type` varchar(20) NOT NULL COMMENT '商品销量类型',
  `scene` varchar(20) DEFAULT 'online' COMMENT 'online线上o2o门店',
  `date` date NOT NULL,
  PRIMARY KEY (`id`),
  KEY `product_id` (`product_id`),
  KEY `date` (`date`),
  KEY `type` (`type`),
  KEY `scene` (`scene`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

/*Data for the table `oms_daily_items_summary` */

/*Table structure for table `oms_daily_offline_summary` */

DROP TABLE IF EXISTS `oms_daily_offline_summary`;

CREATE TABLE `oms_daily_offline_summary` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `date` date NOT NULL COMMENT '日期',
  `type` tinyint(1) NOT NULL COMMENT '1昨天2近七天3近三十天',
  `totalSalesAmount` decimal(30,4) NOT NULL COMMENT '总销售量',
  `totalskinCareSales` decimal(30,4) NOT NULL COMMENT '护肤销量',
  `totoalmakeupSales` decimal(30,4) NOT NULL COMMENT '彩妆销量',
  `totalfragranceSales` decimal(30,4) NOT NULL COMMENT '香水销量',
  `totalhairSales` decimal(30,4) NOT NULL COMMENT '护发销量',
  `byProductSales` text COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '商品销量',
  `baSales` text COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '导购销量',
  `storeSales` text COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '门店销量',
  `citySales` text COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '城市销量',
  PRIMARY KEY (`id`),
  KEY `date` (`date`),
  KEY `type` (`type`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='订单dashboard';

/*Data for the table `oms_daily_offline_summary` */

/*Table structure for table `oms_daily_summary` */

DROP TABLE IF EXISTS `oms_daily_summary`;

CREATE TABLE `oms_daily_summary` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `date` date NOT NULL COMMENT '日期',
  `totalSalesAmount` decimal(30,4) NOT NULL COMMENT '总的销售额',
  `totalSalesCount` int(10) NOT NULL COMMENT '总的成交订单量',
  `totalUserCount` int(10) NOT NULL COMMENT '总的购买人数',
  `averageSalesAmount` decimal(30,4) NOT NULL COMMENT '客单价',
  `totalCreatedSalesCount` int(10) NOT NULL COMMENT '创建的订单量',
  `totalPaidSalesCount` int(10) NOT NULL COMMENT '支付订单量',
  `totalShippedSalesCount` int(10) NOT NULL COMMENT '发货订单量',
  `totalReceivedSalesCount` int(10) NOT NULL COMMENT '签收订单量',
  `totalAfterSalesCount` int(10) NOT NULL COMMENT '售后订单量',
  `yesOrderAccount` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '新老客访问订单占比率-昨日',
  `weekOrderAccount` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '新老客访问订单占比率-7天',
  `monthOrderAccount` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '新老客访问订单占比率-30天',
  `yesUserSecPurchase` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '老客的复购率-昨日',
  `weekUserSecPurchase` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '老客的复购率-7天',
  `monthUserSecPurchase` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '老客的复购率-30天',
  `skinCare` decimal(30,4) NOT NULL COMMENT '各分类销量-护肤',
  `makeUp` decimal(30,4) NOT NULL COMMENT '各分类销量-彩妆',
  `fragrance` decimal(30,4) NOT NULL COMMENT '各分类销量-香水',
  `hair` decimal(30,4) NOT NULL COMMENT '各分类销量-头发',
  `other` decimal(30,4) NOT NULL COMMENT '各分类销量-其他',
  PRIMARY KEY (`id`),
  UNIQUE KEY `date` (`date`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='订单dashboard';

/*Data for the table `oms_daily_summary` */

/*Table structure for table `oms_invoices` */

DROP TABLE IF EXISTS `oms_invoices`;

CREATE TABLE `oms_invoices` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `order_sn` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '订单编号',
  `pos_id` varchar(20) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '用户pos_id',
  `title` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '发票抬头',
  `type` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '发票类型',
  `email` varchar(100) COLLATE utf8mb4_bin DEFAULT NULL,
  `phone` varchar(30) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '手机号',
  `total_free` decimal(10,2) unsigned DEFAULT NULL COMMENT '总金额',
  `number` varchar(30) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '税号',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `order_sn` (`order_sn`),
  KEY `pos_id` (`pos_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin COMMENT='发票';

/*Data for the table `oms_invoices` */

/*Table structure for table `oms_order_express` */

DROP TABLE IF EXISTS `oms_order_express`;

CREATE TABLE `oms_order_express` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `order_sn` varchar(20) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '订单编号',
  `sku` varchar(201) COLLATE utf8mb4_bin DEFAULT NULL COMMENT 'sku',
  `qty` int(10) DEFAULT NULL COMMENT '数量',
  `express_type` varchar(30) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '发货类型',
  `express_no` varchar(20) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '单号',
  `updated_at` timestamp NULL DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP,
  `created_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `order_sn` (`order_sn`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

/*Data for the table `oms_order_express` */

/*Table structure for table `oms_order_items` */

DROP TABLE IF EXISTS `oms_order_items`;

CREATE TABLE `oms_order_items` (
  `id` int(10) NOT NULL AUTO_INCREMENT COMMENT '自增ID',
  `order_main_id` int(10) NOT NULL COMMENT '主订单id',
  `after_sale_id` int(10) DEFAULT '0' COMMENT '售后单id',
  `spu` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'spu',
  `status` tinyint(1) DEFAULT '1' COMMENT '1 初始化 2 售后',
  `is_gift` tinyint(1) DEFAULT '0' COMMENT '是否是小样 1是 0否',
  `is_free` tinyint(1) DEFAULT '0' COMMENT '是否是赠品1 是 0否',
  `order_pos_status` tinyint(1) DEFAULT '0',
  `inventory_pos_status` tinyint(1) DEFAULT '0',
  `revenue_type` tinyint(1) DEFAULT '1' COMMENT '开票类型',
  `inventory_type` varchar(200) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '退回商品状态 ZP 正常 CC残次',
  `cats` varchar(500) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '分类',
  `sku` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'sku',
  `batch` varchar(30) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '批次号',
  `order_sn` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `collection_id` varchar(30) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '套装id',
  `qty` int(10) NOT NULL DEFAULT '1' COMMENT '数量',
  `name` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '产品名称',
  `original_price` decimal(10,4) DEFAULT '0.0000' COMMENT '商品单价 原价',
  `product_amount_total` decimal(10,4) DEFAULT '0.0000' COMMENT '商品总金额',
  `order_amount_total` decimal(10,4) DEFAULT '0.0000' COMMENT '商品付款价格',
  `pic` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '商品缩略图',
  `short_desc` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '短描述',
  `discount` decimal(10,4) DEFAULT '0.0000' COMMENT '打折',
  `type` tinyint(1) DEFAULT '1' COMMENT '1 普通商品  2 套装 ->collection 3 固定套装->sku',
  `collections` text COLLATE utf8mb4_unicode_ci COMMENT '套装',
  `gift_group_id` varchar(15) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '赠品分组id',
  `display_type` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '显示类型  ',
  `spec_property` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '规格属性',
  `spec_desc` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '规格描述',
  `guide_id` int(11) DEFAULT NULL,
  `applied_rule_ids` text CHARACTER SET utf8mb4 COMMENT '促销规则',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP,
  `rule_name` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '促销信息',
  `main_sku` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '主sku',
  `if_show` tinyint(1) DEFAULT '1' COMMENT '是否在展示在前台',
  PRIMARY KEY (`id`),
  KEY `order_main_id` (`order_main_id`) USING BTREE,
  KEY `order_sn` (`order_sn`),
  KEY `after_order_id` (`after_sale_id`),
  KEY `status` (`status`),
  KEY `product_type` (`type`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='子订单';

/*Data for the table `oms_order_items` */

/*Table structure for table `oms_order_logistics_info` */

DROP TABLE IF EXISTS `oms_order_logistics_info`;

CREATE TABLE `oms_order_logistics_info` (
  `id` int(10) NOT NULL AUTO_INCREMENT COMMENT '自增ID',
  `order_id` int(10) DEFAULT NULL,
  `status` smallint(2) DEFAULT '1',
  `desc` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '状态描述',
  `updated_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

/*Data for the table `oms_order_logistics_info` */

/*Table structure for table `oms_order_main` */

DROP TABLE IF EXISTS `oms_order_main`;

CREATE TABLE `oms_order_main` (
  `id` int(10) NOT NULL AUTO_INCREMENT COMMENT '主键ID',
  `user_id` int(10) DEFAULT NULL,
  `after_sale_id` int(10) DEFAULT NULL COMMENT '售后id',
  `wms_order` varchar(20) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'wms 单号',
  `pos_id` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `store_code` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '柜台号',
  `order_sn` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'OMS生成的交易ID',
  `order_status` smallint(2) DEFAULT '1' COMMENT '订单状态',
  `order_state` smallint(2) unsigned DEFAULT '1',
  `share_uid` int(10) DEFAULT NULL COMMENT '分享人id',
  `guide_id` int(10) DEFAULT NULL COMMENT '导购id',
  `level` tinyint(1) DEFAULT NULL COMMENT '用户等级',
  `big_pay_type` tinyint(1) DEFAULT '0' COMMENT '直付大类1 Ali，2 China，3Wx',
  `huabei_period` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '花呗期数',
  `is_exception` tinyint(1) DEFAULT '0' COMMENT '1异常 0正常',
  `transaction_time` datetime DEFAULT NULL COMMENT '交易具体时间',
  `staff_code` varchar(20) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'BA代码',
  `pay_order_sn` varchar(30) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '支付订单号',
  `total_num` int(10) DEFAULT '1' COMMENT '0 商品总件数',
  `open_id` varchar(30) COLLATE utf8mb4_unicode_ci DEFAULT '',
  `payment_at` timestamp NULL DEFAULT NULL COMMENT '预交易订单时间',
  `payment` text COLLATE utf8mb4_unicode_ci COMMENT '预支付信息',
  `payment_type` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '  1AliPay,2 WeixinPay,3 UnionPay 4HuabeiPay 5 Offline 6 miniapp',
  `transaction_date` date DEFAULT NULL COMMENT '交易日期',
  `trade_type` varchar(20) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '详细支付类型',
  `mobile` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '联系电话',
  `channel` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '订单来源渠道',
  `order_type` tinyint(1) DEFAULT '1' COMMENT '1 普通订单 2 付邮',
  `province` varchar(30) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '省份',
  `district` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '区/县',
  `city` varchar(30) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '城市',
  `zip_code` varchar(20) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '邮政编码',
  `has_invoice` tinyint(1) DEFAULT '0' COMMENT '是否有发票信息 0无1有2有开票信息且已开票3小程序已开票',
  `invoice_url` text COLLATE utf8mb4_unicode_ci COMMENT '小程序开票地址',
  `invoice_path` text COLLATE utf8mb4_unicode_ci COMMENT '已开发票地址',
  `invoice_download_url` text COLLATE utf8mb4_unicode_ci COMMENT '发票版式地址',
  `express_no` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '快递单号',
  `received_at` timestamp NULL DEFAULT NULL COMMENT '收货时间',
  `send_at` timestamp NULL DEFAULT NULL COMMENT '发货时间',
  `delivery_mode` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '运输方式EMS EMS \nOTHER 其他（含自提，自送等）\nPOSTB 邮政国内小包 \nSF 顺丰速运 \nSTO 申通E物流\nYTO 圆通速递 \nYUNDA 韵达快运 \nZTO 中通速递',
  `address` varchar(200) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '详细地址',
  `contact` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '联系人',
  `payment_id` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '支付id',
  `remark` varchar(1055) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '备注',
  `used_points` int(10) DEFAULT '0' COMMENT '用户使用积分',
  `activity` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '活动',
  `activity_channel` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '活动渠道',
  `coupon_code` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '卷码',
  `coupon_id` int(11) DEFAULT '0' COMMENT '优惠卷id',
  `total_amount` decimal(10,4) DEFAULT '0.0000' COMMENT '实际总金额',
  `total_ship_fee` decimal(10,2) DEFAULT '0.00' COMMENT '运费',
  `total_wrap_fee` decimal(10,0) DEFAULT '0' COMMENT '包装费',
  `total_product_price` decimal(10,4) DEFAULT '0.0000' COMMENT '产品原始金额',
  `total_discount` decimal(10,4) DEFAULT '0.0000' COMMENT '总打折金额',
  `total_point_discount` decimal(10,4) DEFAULT '0.0000' COMMENT '积分抵扣金额',
  `card_from` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '卡片来自',
  `card_content` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '卡片内容',
  `card_to` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '卡片收件人',
  `share_from` int(10) DEFAULT '0' COMMENT '来自分享人',
  `trigger_status` tinyint(4) DEFAULT '0' COMMENT '有数新增订单触发  0：未处理  1：已处理',
  `return_pay_at` timestamp NULL DEFAULT NULL COMMENT '退款时间',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP,
  `is_sync` tinyint(1) DEFAULT '0' COMMENT '是否已经推送',
  `sync_time` timestamp NULL DEFAULT NULL COMMENT '推送给OMS时间',
  `exception_msg` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '异常信息',
  PRIMARY KEY (`id`),
  UNIQUE KEY `index_oms_order_sn` (`order_sn`) USING BTREE,
  UNIQUE KEY `index_oms_wms_order` (`wms_order`),
  KEY `index_oms_pos_id` (`pos_id`) USING BTREE,
  KEY `index_oms_user_id` (`user_id`) USING BTREE,
  KEY `status` (`order_status`),
  KEY `state` (`order_state`),
  KEY `payment_type` (`payment_type`),
  KEY `mobile` (`mobile`),
  KEY `contact` (`contact`),
  KEY `index_oms_share_from` (`share_from`),
  KEY `index_oms_guide_id` (`guide_id`),
  KEY `index_oms_share_uid` (`share_uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

/*Data for the table `oms_order_main` */

/*Table structure for table `oms_order_pay_success_report` */

DROP TABLE IF EXISTS `oms_order_pay_success_report`;

CREATE TABLE `oms_order_pay_success_report` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `step` char(50) DEFAULT NULL,
  `currencyCode` char(50) DEFAULT NULL,
  `order_sn` varchar(200) DEFAULT NULL,
  `affiliation` char(50) DEFAULT NULL COMMENT 'Store name',
  `revenue` decimal(15,2) DEFAULT '0.00' COMMENT '总金额（含增值税，含运费）',
  `revenueHt` decimal(15,2) DEFAULT '0.00' COMMENT '总金额（不含增值税），包括运费',
  `tax` decimal(15,2) DEFAULT '0.00' COMMENT '税费',
  `shipping` decimal(15,2) DEFAULT '0.00' COMMENT '邮费',
  `transactionGift` char(50) DEFAULT NULL COMMENT 'Gift',
  `transactionShippingService` char(50) DEFAULT NULL COMMENT '快递',
  `transactionShippingFree` char(50) DEFAULT NULL COMMENT '免邮',
  `transactionPayment` char(50) DEFAULT NULL COMMENT '支付方式',
  `coupon` char(50) DEFAULT NULL COMMENT '优惠码',
  `coupon_id` char(50) DEFAULT NULL COMMENT '优惠券ID',
  `created_at` timestamp NULL DEFAULT NULL COMMENT '创建时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='订单支付成功上报';

/*Data for the table `oms_order_pay_success_report` */

/*Table structure for table `oms_order_status` */

DROP TABLE IF EXISTS `oms_order_status`;

CREATE TABLE `oms_order_status` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键Id',
  `status` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '订单状态（客户）',
  `state` tinyint(3) NOT NULL DEFAULT '0' COMMENT '订单状态（OMS）',
  `status_name` varchar(45) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '对应客户订单状态名称',
  `state_name` varchar(45) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '对应OMS订单状态名称',
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '记录创建时间',
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '记录更新时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `status_state_unique` (`status`,`state`)
) ENGINE=InnoDB AUTO_INCREMENT=29 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='订单状态管理';

/*Data for the table `oms_order_status` */

insert  into `oms_order_status`(`id`,`status`,`state`,`status_name`,`state_name`,`created_at`,`updated_at`) values (1,1,1,'未付款','待支付','2020-06-23 17:14:33','2020-12-23 16:45:26'),(2,2,2,'已取消','超时取消','2020-06-23 17:18:50','2020-12-10 14:32:10'),(3,2,3,'已取消','客户取消','2020-06-23 17:18:50','2020-12-10 14:32:12'),(4,2,4,'已取消','客服取消','2020-06-23 17:18:50','2020-12-10 14:32:13'),(5,3,5,'已支付','审核中','2020-06-23 17:20:06','2020-12-10 14:33:54'),(6,3,6,'已支付','审核拒绝','2020-06-23 17:26:35','2020-12-10 14:34:18'),(7,3,7,'已支付','审核通过','2020-06-23 17:26:35','2020-12-12 20:54:43'),(8,4,8,'已发货','已发货','2020-06-23 17:38:25','2020-12-10 14:36:36'),(9,5,9,'退款申请中','发货已拦截','2020-06-23 17:38:25','2020-12-10 14:37:24'),(10,5,10,'退款申请中','货物已回仓','2020-06-23 17:38:25','2020-12-12 20:53:38'),(11,5,11,'退款申请中','银联退款提交完成','2020-06-23 17:40:04','2020-12-10 14:37:29'),(12,7,12,'已退款','审核拒绝','2020-06-23 17:42:20','2020-12-10 14:37:30'),(13,7,13,'已退款','发货已拦截','2020-06-23 17:42:20','2020-12-10 14:37:31'),(14,7,14,'已退款','退货完好','2020-06-23 17:42:20','2020-12-10 14:37:34'),(15,8,15,'退货申请中','拦截失败待收货','2020-06-23 17:43:25','2020-12-10 14:37:36'),(16,9,16,'已完成','已签收','2020-06-23 17:44:20','2020-12-10 14:37:23'),(17,8,17,'退货申请中','货品回仓中','2020-06-23 17:46:27','2020-12-10 14:37:41'),(18,5,18,'退款申请中','货品有残次待退款','2020-06-23 17:48:31','2020-12-10 14:38:09'),(19,7,19,'已退款','货品有残次已退款','2020-06-23 17:49:45','2020-12-10 14:38:05'),(21,5,20,'退款申请中','审核拒绝','2020-07-28 16:26:41','2020-12-10 14:38:15'),(22,8,21,'退货申请中','用户拒收','2020-07-28 19:55:10','2020-12-10 14:37:43'),(23,10,22,'已完成','已完成','2020-08-04 13:54:59','2020-12-10 14:36:46'),(24,11,23,'已取消','已关闭','2020-08-04 13:55:11','2020-12-10 14:37:57'),(25,8,24,'退货申请中','货物已拦截','2020-08-11 15:54:29','2020-12-10 14:37:50'),(26,7,25,'已退款','部分退款','2020-08-11 16:56:18','2020-12-10 14:37:59'),(27,12,7,'待发货','审核通过','2020-12-12 21:00:05','2020-12-19 14:52:35'),(28,13,14,'已退货','退货完好','2020-12-12 21:00:39','2020-12-12 21:00:43');

/*Table structure for table `oms_status_circle` */

DROP TABLE IF EXISTS `oms_status_circle`;

CREATE TABLE `oms_status_circle` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键ID',
  `current_status_id` tinyint(3) unsigned DEFAULT '0' COMMENT '当前状态编号',
  `next_status_id` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '可以装换的状态编号',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT '记录创建时间',
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '记录更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='订单状态流转管理';

/*Data for the table `oms_status_circle` */

/*Table structure for table `order_emails` */

DROP TABLE IF EXISTS `order_emails`;

CREATE TABLE `order_emails` (
  `id` int(1) NOT NULL AUTO_INCREMENT COMMENT '自增id',
  `email` char(50) DEFAULT NULL COMMENT 'email地址',
  `status` tinyint(1) DEFAULT '0' COMMENT '0  正常  1删除',
  `created_at` datetime DEFAULT NULL COMMENT '创建时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

/*Data for the table `order_emails` */

/*Table structure for table `order_gift` */

DROP TABLE IF EXISTS `order_gift`;

CREATE TABLE `order_gift` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT COMMENT '自增id',
  `order_id` int(11) DEFAULT NULL COMMENT '订单id',
  `name` char(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '名称',
  `image` char(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '图片',
  `created_at` timestamp NULL DEFAULT NULL COMMENT '创建时间',
  `updated_at` timestamp NULL DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci ROW_FORMAT=DYNAMIC COMMENT='订单赠品表';

/*Data for the table `order_gift` */

/*Table structure for table `order_goods` */

DROP TABLE IF EXISTS `order_goods`;

CREATE TABLE `order_goods` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `order_id` int(10) unsigned NOT NULL COMMENT '订单id',
  `group_id` int(10) DEFAULT NULL COMMENT '组id',
  `pdt_id` char(100) DEFAULT NULL COMMENT '商品id',
  `price_type` char(10) DEFAULT NULL COMMENT '商品价格类型  Y  计价 ',
  `product_type` char(50) DEFAULT NULL COMMENT '商品类型',
  `product_options` varchar(255) DEFAULT NULL COMMENT '商品option',
  `sku_id` char(100) DEFAULT NULL COMMENT 'SKU',
  `style_number` char(50) DEFAULT NULL COMMENT 'oms 锁库存时使用',
  `series` char(100) DEFAULT NULL COMMENT '前端显示系列名',
  `section` char(100) DEFAULT NULL COMMENT '前端 款号',
  `model_number` char(50) DEFAULT NULL COMMENT '提交订单锁库存 oms 使用 hybris sku编号',
  `image` varchar(255) DEFAULT NULL COMMENT '图片',
  `name` varchar(255) DEFAULT NULL COMMENT '商品名称',
  `option` text COMMENT 'option 信息',
  `weight` varchar(20) DEFAULT '0' COMMENT '商品重量',
  `original_price` decimal(10,2) DEFAULT '0.00' COMMENT '原始价格',
  `price` decimal(10,2) DEFAULT '0.00' COMMENT '价格',
  `labor_price` decimal(10,2) DEFAULT NULL COMMENT '工费',
  `gold_price` decimal(10,2) DEFAULT '0.00' COMMENT '金价',
  `discount` decimal(10,2) DEFAULT '0.00' COMMENT '优惠总金额',
  `inventory` int(10) unsigned DEFAULT '1' COMMENT '数量',
  `applied_rule_ids` text COMMENT '规则id',
  `qty_refunded` int(10) unsigned DEFAULT NULL COMMENT '退货数量',
  `qty_shipped` int(10) unsigned DEFAULT NULL COMMENT '发货数量',
  `lottery_font` tinyint(1) DEFAULT '1' COMMENT '刻字字体  字体，1roma2是arial',
  `content` varchar(255) DEFAULT NULL COMMENT '刻字',
  `pay_time` datetime DEFAULT NULL COMMENT '成功支付时间',
  `status` varchar(30) DEFAULT NULL COMMENT '订单内商品状态   ',
  `assr_status` varchar(30) DEFAULT NULL COMMENT '售后状态',
  `salesRetrnDte` datetime DEFAULT NULL COMMENT '退货退款日期',
  `oms_status` varchar(30) DEFAULT NULL COMMENT 'oms 订单行状态',
  `order_status` varchar(30) DEFAULT NULL COMMENT '订单状态',
  `invc_url` varchar(255) DEFAULT NULL COMMENT '电子发票',
  `policyUrl` varchar(255) DEFAULT NULL COMMENT '电子保单链接',
  `total` decimal(10,2) DEFAULT NULL COMMENT '付款金额',
  `pdttotal` decimal(10,2) DEFAULT NULL COMMENT '商品总价格',
  `promotion_type` char(10) DEFAULT NULL COMMENT '优惠类型 auto   pro    point',
  `promotion_discount` decimal(10,2) DEFAULT '0.00' COMMENT '已享受的，促销，打折，优惠金额',
  `promotion_discount_text` text COMMENT '已享受的，促销，打折，促销名字',
  `promotion_sale` decimal(10,2) DEFAULT '0.00' COMMENT '已享受的，促销，满减，优惠金额',
  `promotion_sale_text` text COMMENT '已享受的，促销，满减，促销名字',
  `promotion_point` decimal(10,2) DEFAULT '0.00' COMMENT '悦享钱抵扣金额',
  `promotion_member` decimal(10,2) DEFAULT '0.00' COMMENT '已享受 会员折扣优惠金额',
  `coupon` decimal(10,2) DEFAULT NULL COMMENT '已享受的，优惠券，优惠金额',
  `offer` decimal(10,2) DEFAULT NULL COMMENT '已享受的，优惠码，优惠金额',
  `saleTotal` decimal(10,2) DEFAULT NULL COMMENT '折扣总计',
  `sale_pdt` decimal(10,2) DEFAULT '0.00' COMMENT '商品折后价',
  `point` int(10) DEFAULT NULL COMMENT '使用悦享钱数量',
  `give_point` int(10) DEFAULT '0' COMMENT '获得悦享钱',
  `disparity` decimal(10,2) DEFAULT '0.00' COMMENT '差价',
  `shipping_id` varchar(100) DEFAULT NULL COMMENT '快递单号',
  `ship_method` char(10) DEFAULT NULL COMMENT '送货方式',
  `shipping_time` int(12) DEFAULT NULL COMMENT '发货时间',
  `is_gift` tinyint(1) DEFAULT '0' COMMENT '是否为赠品   1   是    0   不是',
  `is_service` tinyint(1) DEFAULT '0' COMMENT '是否可退换货   0  否  1  是',
  `channel` varchar(20) DEFAULT NULL COMMENT '渠道号',
  `guide` char(20) DEFAULT NULL COMMENT '导购id',
  `store_code` varchar(20) DEFAULT NULL COMMENT 'guide 对应的的门店号',
  `is_charme` tinyint(1) DEFAULT '0' COMMENT '0  IT   1  CHARMECORD',
  `is_presale` tinyint(1) DEFAULT '0' COMMENT '0 非预售  1  预售',
  `lineNbr` int(10) DEFAULT '0' COMMENT 'oms  取消订单   推送使用',
  `pick_code` varchar(20) DEFAULT NULL COMMENT '取货码',
  `description` text COMMENT '商品描述',
  `refund_amount` float(10,2) DEFAULT '0.00' COMMENT '退款金额',
  `refund_time` datetime DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP COMMENT '退款时间',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT '更新时间',
  `diff_earn_points` int(10) DEFAULT '0' COMMENT '补差价之后，重新计算的行获取的悦享钱',
  PRIMARY KEY (`id`) USING BTREE,
  KEY `order_id` (`order_id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 ROW_FORMAT=DYNAMIC;

/*Data for the table `order_goods` */

/*Table structure for table `order_pcn_relations` */

DROP TABLE IF EXISTS `order_pcn_relations`;

CREATE TABLE `order_pcn_relations` (
  `order_id` int(10) NOT NULL COMMENT '订单主键',
  `product_coupon_name` varchar(50) COLLATE utf8mb4_bin NOT NULL COMMENT '实物券名称',
  PRIMARY KEY (`order_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

/*Data for the table `order_pcn_relations` */

/*Table structure for table `order_rate_config` */

DROP TABLE IF EXISTS `order_rate_config`;

CREATE TABLE `order_rate_config` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `rate` varchar(255) DEFAULT NULL COMMENT '销售目标',
  `days` varchar(255) DEFAULT NULL,
  `created_at` datetime DEFAULT NULL,
  `updated_at` datetime DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

/*Data for the table `order_rate_config` */

/*Table structure for table `order_status_history` */

DROP TABLE IF EXISTS `order_status_history`;

CREATE TABLE `order_status_history` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '自增id',
  `order_id` int(10) unsigned DEFAULT NULL COMMENT '订单id',
  `status` varchar(30) DEFAULT NULL COMMENT 'oms 订单状态',
  `oms_status` varchar(30) DEFAULT NULL COMMENT 'oms 订单状态',
  `comment` text COMMENT '备注',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  PRIMARY KEY (`id`) USING BTREE,
  KEY `order_id` (`order_id`) USING BTREE,
  CONSTRAINT `order_status_history_ibfk_1` FOREIGN KEY (`order_id`) REFERENCES `orders` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 ROW_FORMAT=DYNAMIC;

/*Data for the table `order_status_history` */

/*Table structure for table `orders` */

DROP TABLE IF EXISTS `orders`;

CREATE TABLE `orders` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '订单id',
  `order_sn` varchar(255) DEFAULT NULL COMMENT '订单编号',
  `pay_real_sn` varchar(255) DEFAULT NULL COMMENT '支付真实订单号',
  `status` varchar(50) DEFAULT NULL COMMENT '订单状态 （pay/send/receive/service）',
  `oms_status` varchar(255) DEFAULT NULL COMMENT 'oms 订单状态',
  `applied_rule_ids` varchar(255) DEFAULT NULL COMMENT '促销规则ID',
  `total_qty_ordered` int(10) unsigned DEFAULT NULL COMMENT '订单商品数量',
  `shipping_amount` decimal(12,2) DEFAULT NULL COMMENT '运费',
  `wechat_id` char(50) DEFAULT NULL COMMENT '微信 wechat id ',
  `customer_id` char(50) DEFAULT NULL COMMENT '用户ID',
  `customer_name` varchar(255) DEFAULT NULL COMMENT '用户名称',
  `customer_gender` varchar(255) DEFAULT NULL COMMENT '性别',
  `customer_salute` varchar(20) DEFAULT NULL COMMENT '称谓',
  `customer_level` varchar(255) DEFAULT NULL COMMENT '用户级别',
  `customer_note_notify` text COMMENT '用户留言',
  `service_type` varchar(50) DEFAULT NULL COMMENT '配送方式(分店取货，送货上门)',
  `store_id` varchar(20) DEFAULT NULL COMMENT '门店',
  `store_name` varchar(255) DEFAULT NULL COMMENT '分店名称',
  `store_address` text COMMENT '分店地址',
  `store_open_hour` varchar(255) DEFAULT NULL COMMENT '门店营业描述',
  `store_mobile` varchar(255) DEFAULT NULL COMMENT '门店手机号 可多个',
  `shipping_id` varchar(100) DEFAULT NULL COMMENT '快递单号',
  `shipping_description` varchar(255) DEFAULT NULL COMMENT '货运描述',
  `ship_method` varchar(255) DEFAULT NULL COMMENT '快递公司',
  `shipping_time` int(12) DEFAULT NULL COMMENT '发货时间',
  `consignee` varchar(255) DEFAULT NULL COMMENT '收货人姓名',
  `province` varchar(255) DEFAULT NULL COMMENT '省',
  `city` varchar(255) DEFAULT NULL COMMENT '市',
  `district` varchar(255) DEFAULT NULL COMMENT '区',
  `address` varchar(255) DEFAULT NULL COMMENT '用户地址',
  `phone` varchar(255) DEFAULT NULL COMMENT '用户电话',
  `phone_code` char(10) DEFAULT NULL COMMENT '电话区号',
  `postal_code` varchar(20) DEFAULT NULL COMMENT '邮编',
  `pay_method` varchar(255) DEFAULT NULL COMMENT '支付方式',
  `pay_code` varchar(255) DEFAULT NULL COMMENT '支付状态',
  `transaction_id` varchar(50) DEFAULT NULL COMMENT '交易号',
  `pay_time` datetime DEFAULT NULL COMMENT '支付成功时间',
  `refund_time` datetime DEFAULT NULL COMMENT '退款时间',
  `refund_times` int(2) DEFAULT '0' COMMENT '退款次数',
  `refund_amount` decimal(10,2) DEFAULT '0.00' COMMENT '退款金额',
  `invc_url` varchar(255) DEFAULT NULL COMMENT '电子发票',
  `policyUrl` varchar(255) DEFAULT NULL COMMENT '电子保单',
  `invoice_title` varchar(255) DEFAULT NULL COMMENT '发票标题',
  `invoice_code` char(50) DEFAULT NULL COMMENT '发票识别码',
  `invoice_type` tinyint(1) DEFAULT '1' COMMENT '0  单位 1 个人',
  `total_amount` decimal(10,2) DEFAULT NULL COMMENT '付款金额',
  `pdttotal` decimal(10,2) DEFAULT NULL COMMENT '商品总价格',
  `promotionDiscount` decimal(10,2) DEFAULT NULL COMMENT '已享受的，促销，打折，优惠金额',
  `promotionSale` decimal(10,2) DEFAULT NULL COMMENT '已享受的，促销，满减，优惠金额',
  `coupon_id` int(10) DEFAULT NULL COMMENT '优惠券id',
  `coupon_discount` decimal(10,2) DEFAULT NULL COMMENT '已享受的，优惠券，优惠金额',
  `code_id` char(10) DEFAULT NULL COMMENT '优惠码',
  `code_discount` decimal(10,2) DEFAULT '0.00' COMMENT '已享受的，优惠码，优惠金额',
  `discount` decimal(10,2) DEFAULT '0.00' COMMENT '折扣总计',
  `give_point` decimal(10,2) DEFAULT NULL COMMENT '获得悦享钱数量',
  `point_id` int(10) DEFAULT NULL COMMENT '悦享钱应用规则id',
  `point` decimal(10,2) DEFAULT '0.00' COMMENT '使用悦享钱',
  `point_discount` decimal(10,2) DEFAULT '0.00' COMMENT '悦享钱优惠金额',
  `member_discount` decimal(10,2) DEFAULT '0.00' COMMENT '会员优惠金额',
  `sale_pdt` decimal(10,2) DEFAULT '0.00' COMMENT '商品折后价',
  `disparity` decimal(10,2) DEFAULT '0.00' COMMENT '差价',
  `gift_content` varchar(255) DEFAULT NULL COMMENT '礼品卡内容',
  `gift_from` char(50) DEFAULT NULL COMMENT '礼品卡发件人',
  `gift_to` char(50) DEFAULT NULL COMMENT '礼品卡收件人',
  `remote_ip` varchar(255) DEFAULT NULL COMMENT '远程用户ip',
  `pick_code` varchar(255) DEFAULT NULL COMMENT '取货码',
  `cron_status` tinyint(1) DEFAULT '0' COMMENT '1   需要取消   2  需要更改为已付款   0 无需操作',
  `channel` varchar(20) DEFAULT '0' COMMENT '渠道id',
  `gold_price` text COMMENT '下单时金价，0228新增',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT '订单创建时间',
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '订单更新时间',
  `payment_at` timestamp NULL DEFAULT NULL COMMENT '调起支付信息过期时间',
  PRIMARY KEY (`id`) USING BTREE,
  KEY `status` (`status`) USING BTREE,
  KEY `custid` (`customer_id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 ROW_FORMAT=DYNAMIC;

/*Data for the table `orders` */

/*Table structure for table `prod_order_collects` */

DROP TABLE IF EXISTS `prod_order_collects`;

CREATE TABLE `prod_order_collects` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `total_money` varchar(255) DEFAULT '0' COMMENT '销售额',
  `uv` int(10) DEFAULT NULL,
  `pv` int(10) DEFAULT '0' COMMENT '订单量',
  `days` varchar(20) DEFAULT NULL COMMENT '时间',
  `created_at` timestamp NULL DEFAULT NULL COMMENT '创建时间',
  `updated_at` timestamp NULL DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

/*Data for the table `prod_order_collects` */

/*Table structure for table `subscribe_shipped` */

DROP TABLE IF EXISTS `subscribe_shipped`;

CREATE TABLE `subscribe_shipped` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `openid` varchar(50) CHARACTER SET utf8 DEFAULT NULL,
  `order_sn` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `type` tinyint(1) DEFAULT NULL COMMENT '1 待支付   2   付款    3  发货   4  退款   5    取消',
  `template_id` varchar(100) NOT NULL,
  `template_status` varchar(50) CHARACTER SET utf8 DEFAULT NULL COMMENT 'accept、reject、ban',
  `msg_status` tinyint(1) DEFAULT '1' COMMENT '0 已发送  1未发送',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `state` varchar(20) DEFAULT NULL COMMENT '小程序版本 开发版develop 体验版trial 正式版为空',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 ROW_FORMAT=DYNAMIC COMMENT='消息订阅表';

/*Data for the table `subscribe_shipped` */

/*Table structure for table `timing_guide_ranking` */

DROP TABLE IF EXISTS `timing_guide_ranking`;

CREATE TABLE `timing_guide_ranking` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `guide_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '导购id',
  `store_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '门店id',
  `city_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '城市id',
  `guide_name` varchar(50) COLLATE utf8_bin NOT NULL DEFAULT '' COMMENT '导购名称',
  `store_name` varchar(50) COLLATE utf8_bin NOT NULL DEFAULT '' COMMENT '门店名称',
  `city_name` varchar(50) COLLATE utf8_bin NOT NULL DEFAULT '' COMMENT '城市名称',
  `money` float(10,2) unsigned NOT NULL DEFAULT '0.00' COMMENT '金额',
  `time` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '日期',
  `type` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '1-导购  2-门店  3-城市',
  `created_at` datetime(6) NOT NULL COMMENT '创建时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

/*Data for the table `timing_guide_ranking` */

/*Table structure for table `upay_info` */

DROP TABLE IF EXISTS `upay_info`;

CREATE TABLE `upay_info` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '自增id',
  `terminal_sn` varchar(255) DEFAULT NULL COMMENT '终端号',
  `terminal_key` varchar(255) DEFAULT NULL COMMENT '终端密钥',
  `store_id` varchar(255) DEFAULT NULL COMMENT '门店id',
  `code` varchar(255) DEFAULT NULL COMMENT 'code码',
  `status` tinyint(1) DEFAULT NULL COMMENT '状态',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

/*Data for the table `upay_info` */

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
