<?php
/**
 *  ===========================================
 *  File Name   WxSmallRetainDaily.php
 *  Class Name  admin
 *  Date:       2019-10-25 16:32
 *  Created by
 *  Use for:
 *  ===========================================
 **/

namespace App\Model;


use Illuminate\Database\Eloquent\Model;

class WxSmallVisitDistribution extends Model
{
    static $wxScene = [
        //access_source_session_cnt
        'accs' => [
            '1'  => '小程序历史列表',
            '2'  => '搜索',
            '3'  => '会话',
            '4'  => '扫一扫二维码',
            '5'  => '公众号主页',
            '6'  => '聊天顶部',
            '7'  => '系统桌面',
            '8'  => '小程序主页',
            '9'  => '附近的小程序',
            '10' => '其他',
            '11' => '模板消息',
            '13' => '公众号菜单',
            '14' => 'APP分享',
            '15' => '支付完成页',
            '16' => '长按识别二维码',
            '17' => '相册选取二维码',
            '18' => '公众号文章',
            '19' => '钱包',
            '20' => '卡包',
            '21' => '小程序内卡券',
            '22' => '其他小程序',
            '23' => '其他小程序返回',
            '24' => '卡券适用门店列表',
            '25' => '搜索框快捷入口',
            '26' => '小程序客服消息',
            '27' => '公众号下发',
            '29' => '任务栏-最近使用',
            '30' => '长按小程序菜单圆点',
            '31' => '连wifi成功页',
            '32' => '城市服务',
            '33' => '微信广告',
            '34' => '其他移动应用',
            '35' => '发现入口-我的小程序',
            '36' => '任务栏-我的小程序',
        ],
        
        //access_staytime_info
        'asi'  => [
            '1' => '0-2s',
            '2' => '3-5s',
            '3' => '6-10s',
            '4' => '11-20s',
            '5' => '20-30s',
            '6' => '30-50s',
            '7' => '50-100s',
            '8' => '>100s',
        ],
        'adi'  => [
            '1' => '1 页',
            '2' => '2 页',
            '3' => '3 页',
            '4' => '4 页',
            '5' => '5 页',
            '6' => '6-10 页',
            '7' => '>10 页',
        ],
    
    ];
    
    protected $table = "wx_small_visit_distribution";
    
    //不允许更新的字段
    protected $casts   = [
        'access_source_session_cnt' => 'array',
        'access_staytime_info'      => 'array',
        'access_depth_info'         => 'array',
    ];
    protected $guarded = [];
}
